Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/concepts.po
Languages: fr

source: Concepts and terms
fr: Concepts et définitions

source: BIGSdb is the software platform - not a specific database. There are many instances of BIGSdb databases, so referring to 'the BIGSdb' is meaningless.
fr: BIGSdb est la plate-forme logicielle - pas une base de données spécifique. Il y a de nombreuses instances de bases de données BIGSdb, donc la référence à 'le BIGSdb' ou 'BIGSdb' pour parler d'une base spécifique n'a pas de sens.

source: Loci are regions of the genome that are identified by similarity to a known sequence. They can be defined by DNA or peptide sequence. They are often complete coding sequences (genes), but may represent gene fragments (such as used in MLST), antigenic peptide loops, or indeed any sequence feature.
fr: Les loci (ou locus au singulier) sont des régions du génome qui sont identifiées par similitude avec une séquence connue. Ils peuvent être définis par la séquence nucléotidique ou peptidique. Ce sont souvent des séquences codantes complètes (gènes), mais ils peuvent représenter des fragments de gènes (comme ceux utilisés dans la méthode MLST), des boucles de peptides antigéniques, ou même n'importe quelle portion de séquence.

source: In versions of BIGSdb prior to 1.8.0, an isolate record could only have one live :ref:`allele <alleles>` designation for a locus (inactive/pending designations could be stored within the database but were unavailable for querying or analysis purposes). Since biology is rarely so clean, and some genomes may contain more than one copy of a gene, later versions of the software allow multiple allele designations for a locus, all of which can be queried and analysed.
fr: Dans les versions de BIGSdb antérieures à 1.8.0, une entrée isolat ne pouvait avoir qu'une seule désignation en cours :ref:`allele <alleles>` pour un locus (des désignations inactives/en attente pouvaient être stockées dans la base de données mais n'étaient pas disponibles à des fins de requête ou d'analyse). Étant donné que la biologie est rarement aussi propre et que certains génomes peuvent contenir plus d'une copie d'un gène, les versions ultérieures permettent la désignation de plusieurs allèles pour un locus, qui peuvent tous être interrogés et analysés.

source: Paralogous loci can be difficult to differentiate by sequence similarity alone. Because of this, loci can be further defined by context, where in silico PCR or hybridization reactions can be performed to :ref:`filter the genome <genome_filtering>` to specific regions based on sequence external to the locus.
fr: Les loci paralogues peuvent être difficiles à différencier par la seule similarité de séquence. Pour cette raison, les loci peuvent être définis aussi par leur contexte : une PCR in-silico ou des réactions d'hybridation peuvent être effectuées pour :ref:`filtrer le génome <genome_filtering>` pour des régions spécifiques basées sur une séquence externe au locus.

source: Alleles
fr: Allèles

source: Alleles are instances of loci. Every unique sequence, either DNA or peptide depending on the locus, is defined as a new allele and these are defined in a sequence definition database, where they are given an allele identifier. These identifiers are usually integers, but can be text strings. Allele identifiers in text format can be constrained by length and formatting.
fr: Les allèles sont des séquences particulières d'un locus. Chaque séquence unique, nucléotidique ou peptidique selon le locus, est définie comme un nouvel allèle et définie dans une base de données de définitions de séquences (sequence definition database), où on leur donne un identifiant d'allèle. Ces identifiants sont généralement des nombres entiers, mais peuvent être des chaînes de texte. Les numéros d'allèles au format texte peuvent être limités par la longueur et le formatage.

source: When a specific allele of a locus is identified within the sequence data of an isolate record, the allele designation, i.e. identifier, is associated with the isolate record. This efficiently stores the sequence variation found within an isolate. Two isolates with the same allele designation for a locus have identical sequences at that locus. Once the sequence variation within a genome has been reduced to a series of allele designations, genomes can be efficiently compared by identifying which loci vary between them.
fr: Lorsqu'un allèle spécifique d'un locus est identifié dans les données de séquence d'une entrée isolat, la désignation de l'allèle, c'est-à-dire le numéro d'allèle (ou identifiant), est associée à l'isolat. Ceci répertorie efficacement la variation de séquence trouvée dans un isolat. Deux isolats ayant la même désignation d'allèle pour un locus ont des séquences identiques à ce locus. Une fois que la variation de séquence à l'intérieur d'un génome a été réduite à une série de désignations d'allèles, les génomes peuvent être comparés efficacement en identifiant quels loci varient entre eux.

source: It is important to note that allele identifiers are usually arbitrary and are allocated sequentially in the order of discovery. Alleles with adjacent identifiers may vary by a single nucleotide or by many.
fr: Il est important de noter que les identificants d'allèles sont généralement arbitraires et sont attribués séquentiellement dans l'ordre de leur découverte. Les allèles avec des identifiants adjacents peuvent varier d'un seul nucléotide ou de plusieurs, et des identifiants non adjacents peuvent varier d'un seul nucléotide.

source: Schemes
fr: Schémas

source: Schemes are collections of loci that may be associated with additional field values. At their simplest they just group loci together. Example uses of simple schemes include:
fr: Les schémas sont des collections de loci qui peuvent être associées à des valeurs de champ supplémentaires. Dans le cas le plus simple, ils ne font que regrouper les loci. Voici des exemples d'utilisations de schémas simples :

source: Antibiotic resistance genes
fr: Gènes de résistance aux antibiotiques

source: Genes involved in specific biochemical pathways
fr: Gènes impliqués dans des voies biochimiques spécifiques

source: Antigens
fr: Antigènes

source: Vaccine components
fr: Composantes de vaccin

source: When schemes are associated with additional fields, one of these fields must be the primary key, i.e. its value uniquely defines a particular combination of alleles at its member loci. The pre-eminent example of this is MLST - where a sequence type (ST) is the primary key that uniquely defines combinations of alleles that make up the MLST profiles. Additional fields can also then be included. The values for these need not be unique. In the MLST example, a field for clonal complex can be included, and the same value for this can be set for multiple STs.
fr: Lorsque des schémas sont associés à des champs supplémentaires, l'un de ces champs doit être la clé primaire, c'est-à-dire que sa valeur définit une combinaison unique d'allèles à ses loci membres. L'exemple le plus important est le MLST - où un séquençotype (ou sequence type, ST) est la clé principale qui définit une combinaison d'allèles unique aux loci qui composent le profile MLST. D'autres champs peuvent également être inclus. Ces valeurs ne doivent pas nécessairement être uniques. Dans l'exemple MLST, un champ pour complexe clonal peut être inclus, et la même valeur de complexe clonal peut être définie pour plusieurs ST.

source: Profiles
fr: Profils

source: Profiles are instances of :ref:`schemes <schemes>`. A profile consists of a set of :ref:`allele identifiers <alleles>` for the :ref:`loci <loci>` that comprise the scheme. If the scheme has a primary key field, e.g. sequence type (ST) in MLST schemes, then the unique combination of alleles in a complete profile can be defined by the value of this field.
fr: Les profils sont des instances de :ref:`schemes <schemes>`. Un profil se compose d'un ensemble d'identificants :ref:`allele <alleles>` pour le :ref:`loci <loci>` qui composent le schéma. Si le schéma a un champ clé primaire, par exemple sequence type (ST) dans les schémas MLST, alors la combinaison unique d'allèles dans un profil complet peut être définie par la valeur de ce champ.

source: Classification groups
fr: Groupes de classification

source: Classification groups are a way to cluster scheme profiles using a specified threshold of pairwise allelic mismatches. Currently, single-linkage clustering is supported whereby each member of a group must have no more than the specified number of allelic differences with at least one other member of the group.
fr: Les groupes de classification sont un moyen de regrouper les profils en utilisant un seuil précis de différence allélique paire à paire. À l'heure actuelle, le regroupement single linkage est disponible, selon lequel chaque membre d'un groupe ne doit pas avoir plus que le nombre spécifié de différences alléliques avec au moins un autre membre du groupe.

source: Sequence tags
fr: Balises (Sequence tags)

source: Sequence tags record locus position within an isolate record's sequence bin. The process of creating these tags, is known as :ref:`tag-scanning <tag_scanning>`. A sequence tag consists of:
fr: Les sequence tags enregistrent la position du locus dans le sequence bin (l'ensemble des séquences d'un isolat) Le processus de création de ces tags (ou balises) est connu sous le nom de :ref:`tag-scanning <tag_scanning>`. Un tag consiste en :

source: sequence bin id - this identifies a particular contig
fr: sequence bin id - ceci identifie un contig particulier

source: locus name
fr: nom du locus

source: start position
fr: Position de début

source: end position
fr: position de fin

source: flag to indicate if sequence is reversed
fr: flag (ou drapeau) pour indiquer si la séquence est inversée

source: flag to indicate if sequence is complete and does not continue off the end of the contig
fr: flag pour indiquer si la séquence est complète et ne se poursuit pas au delà de la fin du contig

source: Sets
fr: Sous-ensembles (sets)

source: Sets provide a means to take a large database with multiple loci and/or schemes and present a subset of these as though it was a complete database. The loci and schemes chosen to belong to a set can be renamed when used with this set. The rationale for this is that in a database with disparate isolates and a large number of loci, the naming of these loci may have to be long to specify a species name. For example, you may have a database that contains multiple MLST schemes for different species, but since these schemes may use different fragments of the same genes they may have to be named something like 'Streptococcus_pneumoniae_MLST_aroE' to uniquely specify them. If we define a set for 'Streptococcus pneumoniae' we can then choose to only include S. pneumoniae loci and therefore shorten their names, e.g. to 'aroE'.
fr: Les sous-ensembles (sets en anglais) fournissent un moyen, à partir d'une grande base de données avec de nombreux loci et/ou schémas, de présenter un sous-ensemble de ceux-ci comme s'il s'agissait d'une base de données complète. Les loci et les schémas choisis pour appartenir à un sous-ensemble peuvent être renommés lorsqu'ils sont utilisés avec ce sous-ensemble. L'intérêt est que, dans une base de données comportant des isolats de plusieurs espèces et un grand nombre de loci, le nom de ces loci peut être long afin de spécifier un nom d'espèce. Par exemple, vous pouvez avoir une base de données qui contient plusieurs schémas MLST pour différentes espèces, mais comme ces schémas peuvent utiliser différents fragments des mêmes gènes, ils peuvent devoir être appelés quelque chose comme 'Streptococcus_pneumoniae_MLST_aroE'Si nous définissons un sous-ensemble pour 'Streptococcus pneumoniae' nous pouvons alors choisir d'inclure uniquement les loci pour S. pneumoniae et donc raccourcir leurs noms, par exemple en 'aroE'.
