Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/data_records.po
Languages: fr

source: Data records
fr: Types de données enregistrées (data records)

source: Record pages for different types of data can be accessed following a query by clicking appropriate hyperlinks.
fr: Les pages d'entrées pour différents types de données sont accessibles après une requête en cliquant sur les hyperliens appropriés.

source: Isolate records
fr: Dossiers d'isolats

source: An Isolate record page displays everything known about an isolate.
fr: Une page d'entrée isolat affiche tout ce qu'on sait sur un isolat.

source: Each record will have some or all of the following sections:
fr: Chaque entrée comportera une partie ou la totalité des sections suivantes :

source: Projects
fr: Projets

source: This displays a list of projects that the isolate is a member of. Only projects that have a full description and the 'isolate_display' flag in their settings will be displayed.
fr: Ceci affiche une liste de projets dont l'isolat est membre. Seuls les projets qui ont une description complète et le drapeau 'isolate_display' dans leurs paramètres seront affichés.

source: Provenance metadata
fr: Métadonnées de provenance

source: This section includes:
fr: Cette section comprend:

source: provenance fields
fr: Champs de provenance

source: housekeeping data
fr: données internes

source: who sent the isolate
fr: qui a envoyé l'isolat

source: who last curated
fr: qui a curé en dernier

source: record creation times
fr: date de création

source: last update times
fr: dernières mises à jour

source: links to update history
fr: liens vers l'historique des mises à jour

source: The update link displays page with exact times of who and when updated the record.
fr: Le lien de mise à jour affiche la page avec les momeents exacts de qui a mis à jour l'entrée et quand.

source: This section includes full citation for papers linked to the isolate record. Each citation has a button that will return a dataset of all isolates linked to the paper.
fr: Cette section comprend une citation complète pour les publications liés à l'entrée isolat. Chaque citation a un bouton qui retournera tous les isolats liés à la publication.

source: If there are five or more references they will be hidden by default to avoid cluttering the page too much. Click the 'Show/hide' button to display them in this case.
fr: S'il y a cinq références ou plus, elles seront cachées par défaut pour éviter d'encombrer trop la page. Cliquez sur le bouton 'Show/hide' pour les afficher dans ce cas.

source: Sequence bin summary
fr: Résumé de la corbeille à séquence (sequence bin)

source: This section contains basic statistics describing the sequence bin. Clicking the 'Show sequence bin' button navigates to the :ref:`sequence bin record <sequence_bin_records>`.
fr: Cette section contient des statistiques de base décrivant la corbeille à séquence. En cliquant sur le bouton 'Show sequence bin', vous êtes dirigés vers l'enregistrement :ref:`sequence bin record <sequence_bin_records>`.

source: Scheme and locus data
fr: Données relatives aux schémas et loci

source: A hierarchical tree displays available schemes. Click within internal nodes to expand them.
fr: Un arbre hiérarchique affiche les schémas disponibles. Cliquez sur les nœuds internes pour les agrandir.

source: Clicking any terminal node will display data available for a scheme or group of schemes.
fr: Cliquez sur n'importe quel nœud terminal affichera les données disponibles pour un schéma ou un groupe de schémas.

source: Click an allele number within the scheme profile, will display the appropriate :ref:`allele definition record <allele_definition_records>`. Clicking the green 'S' link will display the appropriate :ref:`sequence tag record <sequence_tag_records>`.
fr: Cliquer sur un numéro d'allèle dans le profil du schéma, affichera l'enregistrement de définition approprié :ref:`allele definition record <allele_definition_records>`. Cliquer sur le lien vert 'S' affichera l'enregistrement approprié :ref:`sequence tag record <sequence_tag_records>`.

source: Allele definition records
fr: Enregistrements de définition d'allèle

source: An allele definition record displays information about a defined allele in a sequence definition database.
fr: Un enregistrement de définition d'allèle affiche des informations sur un allèle défini dans une base de données de définition de séquences (seqdef).

source: If the allele is a member of a scheme profile, e.g. MLST, this will be listed. In this case, there will be a button to display all profiles of that scheme that contain the allele.
fr: Si l'allèle est membre d'un profil de schéma, par exemple MLST, ceci sera listé. Dans ce cas, il y aura un bouton pour afficher tous les profils de ce schéma qui contiennent l'allèle.

source: Similarly, if a :ref:`client database <client_databases>` has been setup for the database and the allele has been identified in an isolate, there will be a button to display all isolates that have that allele.
fr: De même, si une base de données :ref:`client database <client_databases>` a été configurée pour la base de données et que l'allèle a été identifié dans un isolat, il y aura un bouton pour afficher tous les isolats qui ont cet allèle.

source: Sequence tag records
fr: Enregistrements des étiquettes (tags) de séquence

source: A sequence tag record displays information about the location within a contig of a region associated with a locus. The nucleotide sequence will be displayed along with upstream and downstream flanking sequence. The length of these flanking sequences can be modified within the :ref:`general options <general_options>`.
fr: Un enregistrement d'étiquette de séquence affiche des informations sur l'emplacement dans un contig d'une région associée à un locus. La séquence des nucléotides sera affichée en amont et en aval. La longueur de ces séquences flanquantes peut être modifiée à l'aide de :ref:`general options <general_options>`.

source: If the tag is for a DNA locus and it is marked as a coding sequence, the three-frame translation will also be displayed.
fr: Si le tag est pour un locus ADN marqué comme une séquence codante, la traduction dans les trois phases sera également affichée.

source: Profile records
fr: Enregistrements de profils

source: A profile record displays information about a scheme, e.g. MLST, profile. Each allele number within the profile will be hyperlinked. Clicking these will take you to the appropriate :ref:`allele definition record <allele_definition_records>`.
fr: Un enregistrement de profil affiche des informations sur un profil de schéma, par exemple MLST. Chaque numéro d'allèle dans le profil sera un hyperlien. En cliquant dessus, vous obtiendrez l'enregistrement approprié :ref:`allele definition record <allele_definition_records>`.

source: If a :ref:`client database <client_databases>` has been setup for the database and an isolate has the profile, there will be a button to display all isolates that have the profile.
fr: Si une base de données :ref:`client database <client_databases>` a été configurée pour la base de données et qu'un isolat a le profil, il y aura un bouton pour afficher tous les isolats qui ont le profil.

source: Sequence bin records
fr: Enregistrements des corbeilles à séquence

source: A sequence bin record contains information about the contigs associated with an isolate record. This includes:
fr: Un enregistrement de corbeilles à séquence contient des renseignements sur les contigs associés à une entrée isolat. Cela comprend:

source: Number of contigs
fr: Nombre de contigs

source: Total length
fr: Longueur totale

source: Minimum length
fr: Longueur minimale

source: Maximum length
fr: Longueur maximale

source: N50, N90 and N95 values
fr: Valeurs N50, N90 et N95

source: Size distribution charts
fr: Graphiques de distribution des tailles

source: Charts show the distribution of contig sizes and the cumulative contig length against contig number giving a breakdown indication of contig size.
fr: Les graphiques montrent la répartition des tailles de contig et la longueur cumulée des contig par rapport au nombre de contigs, ce qui donne une indication de la taille des contigs.

source: The record includes an embedded genome browser showing the positions of any loci that have been tagged.
fr: L'enregistrement comprend un navigateur de génome intégré montrant les positions de tout locus qui a été étiqueté.

source: There are also links to download the contigs in FASTA, Genbank or EMBL format, along with annotation in GFF3 format.
fr: Il y a aussi des liens pour télécharger les contigs au format FASTA, Genbank ou EMBL, ainsi qu'une annotation au format GFF3.

source: Finally there is a table that shows the loci that are tagged on each contig. Individual contigs can also be downloaded in EMBL or Genbank format.
fr: Enfin, il y a un tableau qui montre les loci qui sont marqués sur chaque contig. Les contigs individuels peuvent également être téléchargés au format EMBL ou Genbank.
