Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/private_records.po
Languages: fr

source: Private records
fr: Entrées privées

source: Users with a status of 'submitter', 'curator', or 'admin' can upload private isolate records that will be hidden from public view. A quota needs to be set for the user by an admin before they are able to do this.
fr: Les utilisateurs ayant un statut de 'submitter', 'curator' ou 'admin' peuvent téléverser des entrées privées d'isolats qui seront cachés de la vue publique. Un quota doit être fixé pour l'utilisateur par un administrateur avant de pouvoir le faire.

source: Uploading private records
fr: Téléversement d'entrées privées

source: In order to upload private records, you need to make sure that you are logged in. If your account has a quota, there will be a menu item called 'Private data'. Click the 'Upload/manage records' link.
fr: Pour téléverser des entrées privées, vous devez vous assurer que vous êtes connecté. Si votre compte a un quota, il y aura un élément de menu appelé 'Private data'. Cliquez sur le lien 'Upload/manage records'.

source: You will see an overview of your quota and links to upload and edit your records. Click the 'Upload private isolate records' link (assuming you have quota available).
fr: Vous verrez un aperçu de votre quota et des liens pour téléverser et modifier vos entrées. Cliquez sur le lien 'Upload private isolate records' (en supposant que vous avez un quota disponible).

source: You will then be taken to a curator page that allows you to upload data copy and pasted from a spreadsheet. There is a link to an Excel template that you will need to use to prepare your data - this is the same template used if you were to submit your data to a curator.
fr: Vous serez ensuite amené à une page de curateur qui vous permet de téléverser des données copiées/collées à partir d'un tableur. Il y a un lien vers un modèle Excel que vous devrez utiliser pour préparer vos données - c'est le même modèle utilisé si vous deviez soumettre vos données à un curateur.

source: See :ref:`batch adding isolate records<batch_isolate_upload>` for details of the upload process.
fr: Voir :ref:`batch adding isolat records<batch_isolate_upload>` pour les détails du processus de téléversement.

source: Modifying private records
fr: Modification des entrées privées

source: Click the 'Private data' link on the contents page.
fr: Cliquez sur le lien 'Private data' de la page de contenu.

source: Now click the 'Update private records' link. You will be taken to the :ref:`curators' interface<update_delete_isolate>`, where you will be able to use the standard curator tools.
fr: Maintenant cliquez sur le lien 'Update private records'. Vous serez amené à l'interface :ref:`curators'<update_delete_isolate>`, où vous pourrez utiliser les outils de curation standards.

source: Use the :ref:`curators' interface<update_delete_isolate>` to make any changes to your isolate records, including :ref:`uploading genome data<upload_contigs>`.
fr: Utiliser l'interface :ref:`curators'<update_delete_isolate>` pour apporter toute modification à vos entrées isolats, y compris :ref:`uploading genome data<upload_contigs>`.

source: Sharing access to private records
fr: Partage de l'accès aux entrées privées

source: If :ref:`user projects<user_projects>` are enabled on the database, you can share access to your private isolates by adding them in to a user project and then sharing this.
fr: Si :ref:`user projects<user_projects>` sont activés pour la base de données, vous pouvez partager l'accès à vos isolats privés en les ajoutant à un projet utilisateur puis en le partageant.

source: See :ref:`user projects<user_projects>` for more details.
fr: Voir :ref:`user projects<user_projects>` pour plus de détails.
