Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/submissions.po
Languages: fr

source: Alternatively, submissions will be removed automatically a specified period of time after closure. By default, this time is 90 days, but this can vary depending on the site configuration.
fr: Sinon, les soumissions seront automatiquement retirées après une période de temps spécifiée après la clôture. Par défaut, ce délai est de 90 jours, mais cela peut varier selon la configuration du site.
