Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/submissions.po
Languages: fr

source: Submitting data using the submission system
fr: Soumission de données à l'aide du système de soumission

source: The automated submission system allows users to submit data (new alleles, profiles, or isolates) to the database curators for assignment and upload to the database. The submission system is enabled on a per-database basis so will not always be available.
fr: Le système automatisé de soumission permet aux utilisateurs de soumettre des données (nouveaux allèles, profils ou isolats) aux curateurs de la base de données pour assignation et téléversement dans la base de données. Le système de soumission est activé par base de données, de sorte qu'il pourrait ne pas être disponible.

source: If the system is enabled, new submissions can be made by clicking the 'Manage submissions' link on the database front page.
fr: Si le système est activé, de nouvelles soumissions peuvent être faites en cliquant sur le lien « Gérer les soumissions » de la page d'accueil de la base de données.

source: Registering a user account
fr: Création d'un compte utilisateur

source: You must have an account for the appropriate database in order to use the submission system. On systems utilizing site-wide databases, such as PubMLST, this can be done automatically via the web. Other sites may require you to contact a curator to set this up.
fr: Vous devez avoir un compte pour la base de données appropriée afin d'utiliser le système de soumission. Sur les systèmes utilisant des bases de données utilisateurs à l'échelle du site, comme PubMLST ou BIGSdb-Pasteur, cela peut être fait automatiquement via le Web. D'autres sites peuvent vous obliger à contacter un curateur pour l'organiser.

source: Allele submission
fr: Soumission d'allèle

source: New allele data can only be submitted from within the appropriate sequence definition database. Submissions consist of one or more new allele sequences for a single locus. You will need to create separate submissions for each locus - this is because different loci may be handled by different curators.
fr: Les nouveaux allèles ne peuvent être soumis qu'à partir de la base de données de définition de séquence (seqdef) appropriée. Les soumissions consistent en une ou plusieurs nouvelles séquences d'allèles pour un seul locus. Vous devrez créer des soumissions distinctes pour chaque locus - ceci parce que différents loci peuvent être traités par différents curateurs.

source: Start
fr: Démarrer

source: Click the 'alleles' link under submission type on the submission management page.
fr: Cliquez sur le lien «allèles» de type de soumission sur la page de gestion des soumissions.

source: Select the submission locus
fr: Sélectionnez le locus de soumission

source: Select the locus from the locus list box:
fr: Sélectionnez le locus dans la liste des locus :

source: The locus list may be very long in some databases. It may be possible to filter these to those belonging to specific schemes. If the scheme tree is shown, select the appropriate scheme, e.g. 'MLST' and click 'Filter'.
fr: La liste des locus peut être très longue dans certaines bases de données. Il peut être possible de les filtrer par schéma. Si l'arborescence du schéma est affichée, sélectionnez le schéma approprié, par exemple 'MLST' et cliquez sur 'Filter'.

source: The locus list is now constrained making selection easier.
fr: La liste des locus est maintenant limitée, ce qui facilite la sélection.

source: Enter details of sequencing method
fr: Entrez les détails de la méthode de séquençage

source: There are a number of fields that must be filled in so that the curator knows how the sequence was obtained:
fr: Il y a un certain nombre de champs qui doivent être remplis pour que le curateur sache comment la séquence a été obtenue:

source: technology - the sequencing platform used, allowed values are:
fr: technologie - la plateforme de séquençage utilisée, les valeurs autorisées sont:

source: other
fr: autres

source: unknown
fr: inconnu

source: read length - this is the length of sequencing reads. This is a required field for Illumina data, and not relevant to Sanger sequencing. Allowed values are:
fr: longueur de lecture - c'est la longueur de lecture de séquençage. Il s'agit d'un champ obligatoire pour les données d'Illumina, et non pertinent pour le séquençage Sanger. Les valeurs autorisées sont les suivantes:

source: coverage - the mean number of reads covering each nucleotide position of the sequence. This is not relevant to Sanger sequencing, Allowed values are:
fr: couverture - le nombre moyen de lectures ('sequence reads') couvrant chaque position nucléotidique de la séquence. Ceci n'est pas pertinent pour le séquençage de type Sanger. Les valeurs autorisées sont:

source: assembly - the means of generating the submitted sequence from the sequencing reads. Allowed values are:
fr: Assemblage - méthode employée pour générer la séquence soumise à partir des lectures. Les valeurs autorisées sont les suivantes:

source: assembly software - this is a free text field where you should enter the name of the software used to generate the submitted sequence.
fr: Logiciel d'assemblage - un champ de texte libre où vous devez entrer le nom du logiciel utilisé pour générer la séquence soumise.

source: Paste in sequence(s)
fr: Coller la séquence(s)

source: Paste in the new variant sequences to the box. This can either be a stand- alone sequence or multiple sequences in FASTA format. The sequences must be trimmed to the start and end points of the loci - check existing allele definitions if in doubt. The submission is likely to be rejected if sequences are not trimmed. Click submit.
fr: Coller les nouvelles séquences dans le formulaire. Cela peut être soit une séquence seule, soit plusieurs séquences au format FASTA. Les séquences doivent être élaguées (trimmed) aux début et fin des loci - vérifier les définitions d'allèles existantes en cas de doute. La soumission sera probablement rejetée si les séquences ne sont pas élaguées. Cliquez sur soumettre.

source: The system will perform some basic checks on the submitted sequences. If any of the sequences have been defined previously they must be removed from the submission before you can proceed. Curators do not want to waste their time dealing with previously defined sequences.
fr: Le système effectuera quelques vérifications de base sur les séquences soumises. Si l'une des séquences a déjà été définie, elle doit être retirée de la soumission avant de pouvoir continuer. Les curateurs ne peuvent pas prendre de leur temps pour faire le tri.

source: Assuming the preliminary checks have passed you will then be able to add additional information to your submission.
fr: En supposant que les vérifications préliminaires aient été effectuées, vous pourrez ajouter des renseignements supplémentaires à votre demande.

source: Add message to curator
fr: Ajouter un message au curateur

source: If you wish to enter a message to the curator, enter this in the messages box and click 'Append'. This is not normally necessary for routine submissions.
fr: Si vous souhaitez saisir un message au curateur, entrez le dans la boîte de messages et cliquez sur 'Annexer'. Cela n'est normalement pas nécessaire pour les soumissions courantes.

source: The message will be attached. A curator may respond to the message and attach their own, with the full conversation becoming part of the submission record.
fr: Le message sera joint. Un curateur peut répondre au message et joindre le sien, la conversation complète devenant partie du dossier de curation.

source: Add supporting files
fr: Ajouter des fichiers

source: Some submissions will require the attachment of supporting files. This will depend on the policies of the individual databases. Sequences determined by Sanger sequencing should normally have forward and reverse trace files attached.
fr: Certaines soumissions exigeront en pièce jointe des fichiers à l'appui. Cela dépendra des politiques de chaque base de données. Les séquences déterminées par le séquençage Sanger devraient normalement avoir des fichiers de chromatogrammes direct et inverse.

source: Files can be added to the submission by dragging and dropping in to the large dotted area in the 'Supporting files' section. Alternatively, you can click this area and select files from the local file system.
fr: Les fichiers peuvent être ajoutés à la soumission en faisant glisser dans la grande zone pointillée dans la section 'Supporting files'. Vous pouvez également cliquer sur cette zone et sélectionner des fichiers locaux.

source: The files will be uploaded and shown in a table.
fr: Les fichiers seront téléversés et affichés dans un tableau.

source: Files can be removed from the submission by checking the appropriate 'Delete' box and clicking 'Delete selected files'.
fr: Les fichiers peuvent être supprimés de la soumission en cochant la case appropriée 'Supprimer' et en cliquant sur 'Delete selected files'.

source: Finalize submission
fr: Finalisation de la soumission

source: Make sure the 'E-mail submission updates' box is checked if you wish to receive E-mail notification of the result of your submission. This setting is remembered between submissions.
fr: Assurez-vous que la case 'E-mail submission updates' est cochée si vous souhaitez recevoir une notification par courriel du résultat de votre soumission. Ce paramètre est enregistré entre les soumissions.

source: Click 'Finalize submission!'.
fr: Cliquez sur 'Finalize submission!'.

source: Your submission will then be listed under 'Pending submissions' on your submission page.
fr: Votre soumission sera ensuite répertoriée sous 'Pending submissions' sur votre page de soumission.

source: Profile submission
fr: Soumission de profils

source: Most MLST databases on PubMLST.org require you to submit an isolate record for each new ST that you wish to be defined. In these cases, you should add the isolate name to the id field of your profile submission and make a corresponding :ref:`isolate submission<isolate_submissions>` containing the allelic profile.
fr: La plupart des bases de données MLST vous obligent à soumettre une entrée isolat pour chaque nouvel ST que vous souhaitez définir. Dans ces cas, vous devez ajouter le nom de l'isolat au champ id de la soumission de votre profil et faire un :ref:`isolate submission<isolate_submissions>` correspondant au profil allélique.

source: Click the appropriate profiles link under submission type on the submission management page.
fr: Cliquez sur le lien approprié pour sélectionner le type de soumission sur la page de gestion des soumissions.

source: Download the Excel submission template.
fr: Téléchargez le modèle de soumission Excel.

source: Paste in profile(s)
fr: Coller des profil(s)

source: Fill in the template. The first column 'id' can be used to enter an identifier that is meaningful to you - it is used to report back the results but is not uploaded to the database. It can be left blank, or the entire column can be removed - in which case individual profiles will be identified by row number.
fr: Remplissez le modèle. La première colonne 'id' peut être utilisée pour saisir un identifiant qui est significatif pour vous - il est utilisé pour rapporter les résultats mais n'est pas téléchargé dans la base de données. Il peut être laissé vide, ou la colonne entière peut être supprimée - auquel cas les profils individuels seront identifiés par numéro de ligne.

source: Copy and paste the entire contents of the submission worksheet. Click submit.
fr: Copier et coller la totalité du contenu de la feuille de travail de soumission. Cliquez sur soumettre.

source: Some basic checks will be performed. These include whether the profile has already been assigned and whether each allele identifier exists. The submission cannot proceed if the checks fail.
fr: Des contrôles de base seront effectués. Il s'agit notamment de déterminer si le profil a déjà été attribué et si chaque identifiant d'allèle existe. La demande ne peut pas être soumise si les vérifications échouent.

source: Provided the checks pass, you will then be able to add additional information to your submission. New profile submissions usually don't require supporting files directly in the submission. You generally will need to make a corresponding :ref:`submission to the isolate database<isolate_submissions>` though.
fr: À condition de passer les vérifications, vous pourrez ensuite ajouter des renseignements supplémentaires à votre soumission. Les nouvelles soumissions de profils n'ont généralement pas besoin de données à l'appui directement dans la soumission. Vous aurez généralement besoin de faire un ::ref:`submission to the isolate database<isolate_submissions>`, néanmoins.

source: If you wish to enter a message to the curator, enter this in the messages box and click 'Append'.
fr: Si vous souhaitez saisir un message au curateur, entrez ceci dans la boîte de messages et cliquez sur 'Append'.

source: Make sure the 'E-mail submission updates' box is checked if you wish to receive E-mail notification of the result of your submission. This setting is remembered between sessions.
fr: Assurez-vous que la case 'E-mail submission updates' est cochée si vous souhaitez recevoir une notification par courriel du résultat de votre soumission. Ce réglage est enregistré entre les sessions.

source: Isolate submission
fr: Soumission d'un isolat

source: New isolate data can only be submitted from within the appropriate isolate database. You may be required to submit isolate data if you would like to get a new MLST sequence type defined, but this depends on individual database policy.
fr: De nouvelles données sur les isolats ne peuvent être fournies que dans la base de données appropriée. Vous pouvez être tenu de soumettre des données d'isolat si vous souhaitez obtenir un nouveau séquençotype MLST, mais cela dépend de la politique de la base de données individuelle.

source: Click the 'isolates' link under submission type on the submission management page.
fr: Cliquez sur le lien 'isolates' dans le type de soumission sur la page de gestion de la soumission.

source: Paste in isolate data
fr: Coller des données isolats

source: Fill in the template. Some fields are required and cannot be left blank. Check the 'Description of database fields' link on the database contents page to see a description of the fields and allowed values where these have been defined. Where allowed values have been set, the template will have dropdown boxes (although these require newer versions of Excel to work).
fr: Remplissez le modèle. Certains champs sont requis et ne peuvent pas être laissés vides. Vérifiez le lien 'Description of database fields' sur la page de contenu de la base de données pour voir une description des champs et des valeurs autorisées lorsqu'ils ont été définis. Lorsque les valeurs autorisées ont été définies, le modèle aura des menus déroulantes.

source: Some databases may have hundreds of loci defined, and most will not have a column in the template. You can add new columns for any loci that have been defined and for which you would like to include allelic information for. These locus names must be the primary locus identifier. A list of loci can be found in the 'allowed_loci' tab of the Excel submission template.
fr: Certaines bases de données peuvent avoir des centaines de loci définis, et la plupart n'auront pas de colonne dans le modèle. Vous pouvez ajouter de nouvelles colonnes pour tout loci qui a été défini et pour lequel vous souhaitez inclure des informations alléliques. Ces noms de locus doivent être le principal identifiant de locus. Une liste des loci se trouve dans l'onglet 'allowed_loci' du modèle de soumission Excel.

source: Some basic checks will be performed. These include checking all field values conform to allowed lists or data types. The submission cannot proceed if any checks fail.
fr: Des contrôles basiques seront effectués. Il s'agit notamment de vérifier que toutes les valeurs sont conformes aux listes ou types de données autorisés. La demande ne peut pas être poursuivie si des vérifications échouent.

source: Provided the checks pass, you will then be able to add additional information to your submission.
fr: À condition de passer les vérifications, vous pourrez ensuite ajouter des renseignements supplémentaires à votre soumission.

source: Genome submission
fr: Soumission de génome

source: Submitting genomes uses the same process as standard :ref:`isolate submission<isolate_submissions>`. The only difference is that there are a couple of extra required fields in the submission table:
fr: Soumettre des génomes utilise le même processus standard :ref:`isolate submission<isolate_submissions>`. La seule différence est qu'il y a quelques champs supplémentaires requis dans le tableau de soumission:

source: assembly_filename - this is the name of the FASTA file containing the assembly contigs. This must be uploaded as a supporting file - you will not be able to finalize the submission until every isolate record has a matching contig file.
fr: assembly_filename - c'est le nom du fichier FASTA contenant les contigs d'assemblage. Ceci doit être téléversé comme un fichier à joindre - vous ne serez pas en mesure de finaliser la soumission jusqu'à ce que chaque entrée isolat a un fichier contigs correspondant.

source: sequence_method - the sequencing technology used to generate the sequences. The allowed values are listed on the submission page.
fr: sequence_method - la technologie de séquençage utilisée pour générer les séquences. Les valeurs autorisées sont énumérées sur la page de soumission.

source: Locus fields are not usually included in a genome submission as these can be readily extracted from the genome.
fr: Les champs de locus ne sont habituellement pas inclus dans une soumission de génome car ils peuvent être facilement extraits du génome.

source: To start the submission, click the 'genomes' link under submission type on the submission management page.
fr: Pour démarrer la soumission, cliquez sur le lien 'genomes' dans le type de soumission sur la page de gestion de la soumission.

source: Then follow the steps for :ref:`isolate submission<isolate_submissions>`, uploading the contig files as supporting files. You will be able to finalize the submission only after all the assembly files have been uploaded.
fr: Suivez ensuite les étapes pour :ref:`isolate submission<isolate_submissions>`, en téléversant les fichiers contigs. Vous ne pourrez finaliser la soumission qu'après le téléversement de tous les fichiers de contigs.

source: When including the filename for your FASTA file containing the genome assembly, please note that Windows will, by default, hide the file extension, e.g. .fas or .fasta. Even if it is hidden in the Windows interface, the file extension is part of the filename and must be included so that the uploaded file has exactly the same name as entered in the submission template. See https://www.techadvisor.co.uk/how-to/windows/windows-10-file-extensions-3697651 to see how to display hidden file extensions in Windows 10.
fr: Lors de l'inclusion du nom de fichier de votre fichier FASTA contenant l'ensemble du génome, veuillez noter que Windows cachera par défaut l'extension de fichier, par exemple .fas ou .fasta. Même s'il est caché dans l'interface Windows, l'extension de fichier fait partie du nom du fichier et doit être incluse de sorte que le fichier téléchargé ait exactement le même nom que celui entré dans le formulaire de soumission. Voir https://www.techadvisor.co.uk/how-to/windows/windows-10-file-extensions-3697651 pour voir comment afficher les extensions de fichiers cachés dans Windows 10.

source: Assembly submission
fr: Soumission d'assemblage

source: Genome assemblies can be submitted to add to existing isolate records. These are often old records that have been submitted with just MLST results but whole genome sequencing has been performed later.
fr: Les assemblages génomiques peuvent être soumis pour être ajoutés aux entrées d'isolats existants. Ce sont souvent de vieilles entrées qui ont été soumises avec seulement des données MLST, lorsque le séquençage du génome entier a été effectué plus tard.

source: Click the 'assemblies' link under submission type on the submission management page.
fr: Cliquez sur le lien 'assemblies' dans le type de soumission sur la page de gestion des soumissions.

source: Link assembly files to isolate records
fr: Lier les fichiers d'assemblage aux entrées isolats

source: You need to tell the system which isolate record should be linked to each assembly that is being uploaded. In order to do this you should prepare a spreadsheet consisting of four columns that you then copy and paste into the web form. The columns are:
fr: Vous devez dire au système quel assemblage doit être lié à chaque entrée. Pour ce faire, vous devez préparer un tableur composé de quatre colonnes que vous copiez et collez ensuite dans le formulaire. Les colonnes sont les suivantes:

source: Both the database id and isolate name are used so that they can be cross-checked to ensure that the correct isolate record has been selected.
fr: L'identifiant (id) de l'entrée dans la base de données et le nom de l'isolat sont tous deux utilisés de façon à pouvoir être recoupés pour s'assurer que la bonne entrée de l'isolat a été sélectionnée.

source: Click 'Submit' and the system will check that the id and isolate names correspond to isolate records that do not currently have assemblies. Provided these match, you will then be prompted to drag-and-drop your genome assemblies on to the web form. A check will also be performed to see if you are the original submitter of the isolate. If you are not, you can still make the submission but should add a message to the curator to confirm why you are adding assemblies for these records.
fr: Cliquez sur 'Submit' et le système vérifiera que les id et les noms correspondent à des entrées isolats qui n'ont pas actuellement d'assemblages. A condition que cette corresopndance soit établie, vous serez ensuite invité à glisser-déposer vos assemblages de génome sur le formulaire web. Une vérification sera également effectuée pour voir si vous êtes l'auteur original de l'isolat. Si ce n'est pas le cas, vous pouvez toujours faire la soumission, mais vous devez ajouter un message au curateur pour confirmer pourquoi vous ajoutez des assemblages pour ces entrées.

source: Once the files have been uploaded and passed validation, add any message to the curator if necessary, e.g. if the original isolate submissions were made by someone else. Click 'Finalize submission'.
fr: Une fois que les fichiers ont été téléversés et validés, ajoutez tout message au curateur si nécessaire, par exemple si les soumissions originales d'isolats ont été faites par quelqu'un d'autre. Cliquez sur 'Finalize submission'.

source: Removing submissions from your notification list
fr: Supprimer les soumissions de votre liste de notifications

source: Once a submission has been closed by a curator, the results will be displayed in your 'Manage submissions' area. You can remove submissions once you have noted the result by clicking the 'Remove' link.
fr: Une fois qu'une soumission a été fermée par un curateur, les résultats seront affichés dans votre zone « Gérer les soumissions ». Vous pouvez supprimer les soumissions une fois que vous avez noté le résultat en cliquant sur le lien 'Remove'.
