Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/user_projects.po
Languages: fr

source: User projects
fr: Projets utilisateurs

source: If user projects are enabled, authenticated users are able to set up their own projects in order to group isolates for analysis. If private data and user quotas are enabled, these projects can include private records that can then be shared with other user accounts. Note, that simply adding a record to a user project does not make the record itself private.
fr: Si les projets d'utilisateurs sont activés, les utilisateurs authentifiés peuvent mettre en place leurs propres projets afin de regrouper les isolats pour analyse. Si les quotas de données et d'utilisateurs privés sont activés, ces projets peuvent inclure des entrées privées qui peuvent ensuite être partagées avec d'autres comptes utilisateurs. Notez que l'ajout d'une entrée isolat à un projet d'utilisateur ne rend pas l'entrée elle-même privée.

source: User projects can be enabled by an administrator by setting 'user_projects="yes"' in the :ref:`config.xml<isolate_xml>` file for the database.
fr: Les projets utilisateurs peuvent être activés par un administrateur en définissant le fichier 'user_projects=yes' dans le fichier :ref:`config.xml<isolate_xml>` pour la base de données.

source: To create a new project, go to the isolate database contents page and expand the 'Projects' section. Click 'Your projects'.
fr: Pour créer un nouveau projet, allez à la page de contenu de la base de données isolats et ouvrez la section 'Projects'. Cliquez sur 'Your projects'.

source: Enter the name of your project (this must be unique on the system - you will be told if the name is already used). You can optionally include a description - if you do this, this will appear within :ref:`isolate records<isolate_records>` when accessed from your account. Click 'Create'.
fr: Saisissez le nom de votre projet (cela doit être unique sur le système - vous serez informé si le nom est déjà utilisé). Vous pouvez éventuellement inclure une description - si vous le faites, cela apparaîtra dans :ref:`isolate records<isolate_records>` lorsque vous y accédez. Cliquez sur 'Create'.

source: You can either add isolates to your project directly following a query or by manually editing a list of ids.
fr: Vous pouvez soit ajouter des isolats à votre projet directement après une requête, soit en éditant manuellement une liste d'ids.

source: Adding isolates to a user project following a query
fr: Ajout d'isolats à un projet utilisateur suite à une requête

source: Perform an isolate database query. If you have set up a project, there will be a link in the results header box. Select your project and click 'Add these records'.
fr: Effectuer une requête de base de données isolats. Si vous avez configuré un projet, il y aura un lien dans l'en-tête des résultats. Sélectionnez votre projet et cliquez sur 'Add these records'.

source: The records will be added to the project. Please note that it doesn't matter whether any of the records have been previously added.
fr: Les entrées seront ajoutées au projet. Veuillez noter qu'il n'est pas important de savoir si l'une des entrées a déjà été ajoutée.

source: Adding or removing isolates belonging to a user project by editing a list
fr: Ajouter ou supprimer des isolats appartenant à un projet utilisateur en éditant une liste

source: From the user projects page, click the 'Add/remove records' link for the project that you wish to modify.
fr: À partir de la page des projets utilisateurs, cliquez sur le lien 'Add/remove records' pour le projet que vous souhaitez modifier.

source: Edit the list of ids of records belonging to the list. You can copy and paste this list if you wish to prepare it in a spreadsheet or text editor. Click 'Update' when finished.
fr: Modifier la liste des identifiants des entrées appartenant à la liste. Vous pouvez copier et coller cette liste si vous souhaitez la préparer dans un tableur ou un éditeur de texte. Cliquez sur 'Update' une fois terminé.

source: Accessing project isolates
fr: Accès aux isolats du projet

source: To browse isolate records belonging to a project, go to the user projects page and click the 'Browse' link for the project.
fr: Pour parcourir les entrées isolats appartenant à un projet, allez à la page des projets utilisateurs et cliquez sur le lien 'Browse' pour le projet.

source: Alternatively, you can select the project from the :ref:`projects filter<query_filters>` on the isolate query page. This would enable you to combine the project with additional search criteria
fr: Vous pouvez également sélectionner le projet à partir du filtre :ref:`projects filter<query_filters>` sur la page de requête isolats. Cela vous permettrait de combiner le projet avec des critères de recherche supplémentaires

source: Please note that you will only see your project in the filter list if you are logged in. As a private project, only you will see it.
fr: Veuillez noter que vous ne verrez votre projet dans la liste des filtres que si vous êtes connecté. En tant que projet privé, vous seul le verrez.

source: Allowing other users to share your project
fr: Permettre aux autres utilisateurs de partager votre projet

source: You can share a project that you own with any other user. In order to do this, you must know the username that they use to log in with. They will see the project in their own list of private projects and in the query interface projects filter.
fr: Vous pouvez partager un projet que vous possédez avec n'importe quel autre utilisateur. Pour ce faire, vous devez connaître le nom d'utilisateur avec lequel il se connecte. Cet utilisateur verra le projet dans sa propre liste de projets privés et dans le filtre des projets d'interface de requête.

source: From the user projects page, click the 'Modify users' link for the specified project:
fr: À partir de la page des projets utilisateurs, cliquez sur le lien 'Modify users' pour le projet spécifié:

source: Enter the username of the person you wish to share with and click 'Add user':
fr: Entrez le nom d'utilisateur de la personne avec laquelle vous souhaitez partager et cliquez sur 'Add user' :

source: If user groups are in use, you can also share your project with all members of a user group from the same page.
fr: Si des groupes d'utilisateurs sont utilisés, vous pouvez également partager votre projet avec tous les membres d'un groupe d'utilisateurs à partir de la même page.

source: Once a user has been added, you can give them permission to administer (add other users, modify the description or delete) or add/remove records to the project:
fr: Une fois qu'un utilisateur a été ajouté, vous pouvez lui donner la permission d'administrer (ajouter d'autres utilisateurs, modifier la description ou supprimer) ou ajouter/supprimer des entrées au projet:

source: Deleting a user project
fr: Suppression d'un projet utilisateur

source: You can delete a project from the user projects page by clicking the 'Delete' link next to the project in question.
fr: Vous pouvez supprimer un projet de la page des projets utilisateurs en cliquant sur le lien 'Delete' du projet en question.

source: If the project contains any isolates you will be asked for confirmation. Click the 'Delete project' button.
fr: Si le projet contient des isolats, on vous demandera une confirmation. Cliquez sur le bouton 'Delete project'.

source: If the project contains no isolates, the confirmation page is skipped and the project is removed immediately.
fr: Si le projet ne contient aucun isolat, la page de confirmation est ignorée et le projet est immédiatement retiré.

source: Removing a project does not delete the isolate records belonging to it. A project is simply a means of grouping records.
fr: L'élimination d'un projet ne supprime pas les entrées isolats qui lui appartiennent. Un projet est simplement un moyen de regrouper les entrées.
