Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/data_query/0010_determine_allele_identity.po
Languages: fr

source: Querying sequences to determine allele identity
fr: Recherche dans les séquences pour déterminer l'identité d'allèles

source: Sequence queries are performed in the sequence definition database. Click 'Single sequence' query from the contents page.
fr: Les requêtes de séquence sont effectuées dans la base de données de définition de séquence (seqdef). Cliquez sur la requête 'Single sequence' de la page de contenu.

source: Paste your sequence in to the box - there is no need to trim. Often, you can leave the locus setting on 'All loci' - the software should identify the correct locus based on your sequence. Sometimes, especially in databases with a large number of defined loci, it may be quicker, however, to select the specific locus or scheme (e.g. MLST) that a locus belongs to.
fr: Coller votre séquence dans la boîte - il n'est pas nécessaire d'élaguer. Souvent, vous pouvez laisser le réglage du locus sur 'All loci' - le logiciel devrait identifier le locus correct en fonction de votre séquence. Toutefois, en particulier dans les bases de données comportant un grand nombre de locus définis, il peut être plus rapide de choisir le locus ou le schéma spécifique (par exemple MLST) auquel un locus appartient.

source: If the locus you are querying is a shorter version of another, e.g. an MLST fragment of a gene where the full length gene is also defined, you will need to select the specific locus or the scheme from the dropdown box. Leaving the selection on 'All loci' will return a match to the longer sequence in preference to the shorter one.
fr: Si le locus que vous interrogez est une version plus courte d'un autre, par exemple un fragment MLST d'un gène où le gène de pleine longueur est également défini, vous devrez sélectionner le locus spécifique ou le schéma dans la boîte déroulante. Laisser la sélection sur 'All loci' retournera une correspondance avec la séquence la plus longue de préférence à la plus courte.

source: Click 'Submit'.
fr: Cliquez sur 'Submit'.

source: If an exact match is found, this will be indicated along with the start position of the locus within your sequence.
fr: Si une correspondance exacte est trouvée, cela sera indiqué avec la position de début du locus dans votre séquence.

source: If only a partial match is found, the most similar allele is identified along with any nucleotide differences. The varying nucleotide positions are numbered both relative to the pasted in sequence and to the reference sequence. The start position of the locus within your sequence is also indicated.
fr: Si on ne trouve qu'une correspondance partielle, l'allèle le plus semblable est identifié avec la ou les différence(s) de nucléotides. Les différentes positions des nucléotides sont numérotées par rapport à la séquence collée et à la séquence de référence. La position de départ du locus dans votre séquence est également indiquée.

source: As an alternative to pasting a sequence in to the box, you can also choose to upload sequences in FASTA format by clicking the file browse button.
fr: Comme alternative à coller une séquence dans la boîte, vous pouvez également choisir de téléverser des séquences au format FASTA en cliquant sur le bouton de recherche de fichier.

source: Querying whole genome data
fr: Interroger les séquences de génome entier

source: The sequence query is not limited to single genes. You can also paste or upload whole genomes - these can be in multiple contigs. If you select a specific scheme from the dropdown box, all loci belonging to that scheme will be checked (although only exact matches are reported for a locus if one of the other loci has an exact match). If all loci are matched, scheme fields will also be returned if these are defined. This, for example, enables you to identify the MLST sequence type of a genome in one step.
fr: La requête de séquence ne se limite pas aux gènes uniques. Vous pouvez également coller ou téléverser des génomes entiers - ceux-ci peuvent être dans plusieurs contigs. Si vous sélectionnez un schéma spécifique dans la zone déroulante, tous les loci appartenant à ce schéma seront vérifiés (bien que seules les correspondances exactes soient déclarées pour un locus si l'un des autres loci a une correspondance exacte). Si tous les loci sont trouvés avec un allèle existant, les champs de schéma seront également retournés si ces derniers sont définis. Cela vous permet, par exemple, d'identifier le séquençotype MLST d'un génome en une seule étape.

source: Querying multiple sequences to identify allele identities
fr: Interroger plusieurs séquences pour identifier les identités des allèles

source: You can also query mutiple sequences together. These should be in FASTA format. Click 'Batch sequences' from the contents page.
fr: Vous pouvez également interroger des séquences mutiples ensemble. Elles devraient être en format FASTA. Cliquez sur 'Batch sequences' à partir de la page de contenu.

source: Paste your sequences (FASTA format) in to the box. Select a specific locus, scheme or 'All loci'.
fr: Coller vos séquences (format FASTA) dans la boîte. Sélectionnez un locus, un schéma ou 'All loci'.

source: The best match will be displayed for each sequence in your file. If this isn't an exact match, the differences will be listed.
fr: La meilleure correspondance sera affichée pour chaque séquence de votre fichier. Si ce n'est pas une correspondance exacte, les différences seront listées.
