Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/data_query/0020_search_sequence_attributes.po
Languages: fr

source: Searching for specific allele definitions
fr: Recherche de définitions d'allèles spécifiques

source: There are two query pages available that allow searching for specific allele definitions. The first allows querying of all loci together by criteria that are common to all. The second is a locus-specific attribute query that can search on any extended attributes that may be defined for a locus. This locus- specific query also allows you to paste in lists of alleles for download or analysis.
fr: Il existe deux pages de requête qui permettent de rechercher des définitions d'allèles spécifiques. La première permet d'interroger tous les loci ensemble par des critères communs à tous. La seconde est une requête d'attribut spécifique à un locus qui peut rechercher sur tous les attributs étendus qui peuvent être définis pour un locus. Cette requête spécifique vous permet également de coller dans des listes d'allèles pour téléchargement ou analyse.

source: General (all loci) sequence attribute search
fr: Recherche d'attributs de séquence générale (tous loci)

source: To retrieve specific allele designations, click 'By specific criteria' in the 'Find alleles' section on a sequence definition database contents page.
fr: Pour récupérer des désignations d'allèles spécifiques, cliquez sur 'By specific criteria' dans la section 'Find alleles' sur une page de contenu de la base de données de définition de séquences.

source: Enter your query using the dropdown search box - additional terms can be added by clicking the '+' button.
fr: Entrez votre requête en utilisant la zone de recherche déroulante - des termes supplémentaires peuvent être ajoutés en cliquant sur le bouton '+'.

source: Designations can be queried using :ref:`standard operators <query_operators>`.
fr: Les désignations peuvent être demandées en utilisant :ref:`standard operators <query_operators>`.

source: Click 'Search'.
fr: Cliquez sur 'Search'.

source: Click the hyperlinked results to display allele records.
fr: Cliquez sur les résultats hyperliens pour afficher les allèles.

source: Various search criteria can also be selected by combining with filters. Click the filter heading to display these.
fr: Divers critères de recherche peuvent également être sélectionnés en combinant avec des filtres. Cliquez sur l'en-tête du filtre pour les afficher.

source: Locus-specific sequence attribute search
fr: Recherche d'attributs de séquence spécifiques à un locus

source: Some loci have :ref:`extended attribute fields <locus_extended_attributes>`. To query these, click 'By locus' in the 'Find alleles' section on a sequence definition database contents page.
fr: Certains loci ont :ref:`extended attribute fields <locus_extended_attributes>`. Pour les interroger, cliquez sur 'By locus' dans la section 'Find alleles' sur une page de contenu de la base de données de définition de séquences.

source: Pick the required locus from the dropdown box.
fr: Choisissez le locus requis dans la boîte déroulante.

source: The fields specific for that locus will be added to the dropdown query boxes.
fr: Les champs spécifiques pour ce locus seront ajoutés aux zones de requête déroulantes.

source: The query form can be modified by clicking the 'Modify form options' tab:
fr: Le formulaire de requête peut être modifié en cliquant sur l'onglet 'Modify form options' :

source: A list box can be added by clicking the 'Show' button for 'Allele id list box'.
fr: Une boîte de liste peut être ajoutée en cliquant sur le bouton 'Show' pour 'Allele id list box'.

source: Close the form modification tab and you can now enter a list of allele ids for retrieval.
fr: Fermez l'onglet de modification de formulaire et vous pouvez maintenant entrer une liste d'identifiants allèles pour les récupérer.

source: Various analysis and export options will be available for use on the retrieved sequences. These include FASTA output and :ref:`Locus Explorer<locus_explorer>` analysis.
fr: Diverses options d'analyse et d'exportation seront disponibles sur les séquences récupérées. Elles comprennent la sortie FASTA et l'analyse :ref:`Locus Explorer<locus_explorer>`.
