Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/data_query/0030_search_scheme_profiles.po
Languages: fr

source: Browsing scheme profile definitions
fr: Recherche de profiles

source: If a sequence definition database has schemes defined that include a primary key field, i.e. collections of loci that together create profiles, e.g. for MLST, these can be browsed by clicking the link 'By specific criteria' in the 'Search for allelic profiles' section.
fr: Si une base de données de définition de séquences a des schémas définis qui incluent un champ clé primaire, c'est-à-dire des collections de loci qui créent ensemble des profils, par exemple pour MLST, ceux-ci peuvent être parcourus en cliquant sur le lien 'By specific criteria' dans la section 'Search for allelic profiles'.

source: Leave query form fields blank (the display of these may vary depending on modification options set by the user). Choose the field to order the results by, the number of results per page to display, and click 'Search'.
fr: Laisser les champs du formulaire de requête vide (l'affichage de ceux-ci peut varier selon les options de modification définies par l'utilisateur). Choisissez le champ pour trier les résultats, le nombre de résultats par page à afficher, et cliquez sur 'Search'.

source: Clicking the hyperlink for any profile will display full information about the profile.
fr: Cliquer sur l'hyperlien d'un profil affichera toutes les informations sur le profil.

source: Querying scheme profile definitions
fr: Recherche de définitions de profiles

source: Click the link to 'By specific criteria' link in the 'Search for allelic profiles' section.
fr: Cliquez sur le lien 'By specific criteria' dans la section 'Search for allelic profiles'.

source: Enter the search criteria you wish to search on. You can add search criteria by clicking the '+' button in the 'Locus/scheme fields' section. These can be combined using 'AND' or 'OR'.
fr: Entrez les critères de recherche que vous souhaitez rechercher. Vous pouvez ajouter des critères de recherche en cliquant sur le bouton '+' dans la section 'Locus/scheme fields'. Ils peuvent être combinés avec 'AND' ou 'OR'.

source: Each field can be queried using :ref:`standard operators <query_operators>`.
fr: Chaque champ peut être interrogé en utilisant :ref:`standard operators <query_operators>`.

source: Other query options are available by clicking the 'Modify form options' tab.
fr: D'autres options de recherche sont disponibles en cliquant sur l'onglet 'Modify form options'.

source: For example, you can enter a list of attributes to query on by clicking the 'Show' button next to 'Attribute values list'.
fr: Par exemple, vous pouvez saisir une liste d'attributs à rechercher en cliquant sur le bouton 'Show' à côté de 'Attribute values list'.

source: A list box will appear within the page. Hide the form modification tab by clicking the 'X' in the corner or the purple tab again. Now you can choose the attribute to search on along with a list of values.
fr: Une boîte de liste apparaîtra dans la page. Cacher l'onglet modification du formulaire en cliquant de nouveau sur le 'X' dans le coin ou sur l'onglet violet. Maintenant, vous pouvez choisir l'attribut à rechercher avec une liste de valeurs.

source: List values will be combined with any other attributes entered in the query form allowing complex queries can be constructed.
fr: Les valeurs de liste seront combinées avec tous les autres attributs entrés dans le formulaire de requête permettant de construire des requêtes complexes.

source: You can also add filters to the form by again clicking the 'Modify form options' tab and selecting 'Filters'.
fr: Vous pouvez également ajouter des filtres au formulaire en cliquant de nouveau sur l'onglet 'Modify form options' et en sélectionnant 'Filters'.

source: Available filters will vary depending on the database. These will be combined with other query criteria or lists of attributes.
fr: Les filtres disponibles varient selon la base de données. Ils seront combinés avec d'autres critères de requête ou listes d'attributs.
