Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/data_query/0040_search_allelic_profiles.po
Languages: fr

source: Identifying allelic profile definitions
fr: Identification des définitions de profil allélique

source: For schemes such as MLST you can query allelic combinations to identify the sequence type (or more generically, the primary key of the profile).
fr: Pour des schémas tels que MLST, vous pouvez interroger des combinaisons alléliques pour identifier le séquençotype (ou plus généralement, la clé primaire du profil).

source: Click the 'By allelic profile' link in the 'Search for allelic profiles' section on a the sequence definition contents page.
fr: Cliquez sur le lien 'By allelic profile' dans la section 'Search for allelic profiles' d'une page de définition de séquence.

source: If multiple schemes are defined in the database you should select the scheme you wish to check.
fr: Si plusieurs schémas sont définis dans la base de données, vous devez sélectionner le schéma que vous souhaitez rechercher.

source: Enter a combination of allelic values (you can enter a partial profile if you wish).
fr: Saisissez une combinaison de valeurs alléliques (vous pouvez saisir un profil partiel si vous le souhaitez).

source: Alternatively, you can automatically populate a profile by entering a value for the scheme primary key field (e.g. ST) and clicking 'Autofill'.
fr: Alternativement, vous pouvez automatiquement remplir un profil en entrant une valeur pour le champ clé primaire du schéma (par exemple ST) et en cliquant sur 'Autofill'.

source: To find the closest or exact match, leave the search box on 'Exact or nearest match' and click 'Submit'. The best match will be displayed.
fr: Pour trouver la correspondance la plus proche ou exacte, laissez la case de recherche sur 'Exact or nearest match' et cliquez sur 'Submit'. Le meilleur résultat sera affiché.

source: Alternatively, if you wish to find all profiles that match the query profile by at least a set number of loci, select the appropriate value in the search dropdown box, e.g. '4 or more matches' will show related profiles that share at least 4 alleles with the query.
fr: Alternativement, si vous souhaitez trouver tous les profils qui correspondent au profil de la requête par au moins un nombre défini de loci, sélectionnez la valeur appropriée dans la boîte déroulante de recherche, par exemple '4 or more matches' affichera les profils associés qui partagent au moins 4 allèles avec la requête.

source: Batch profile queries
fr: Recherche de profils par lots

source: To lookup scheme definitions, e.g. the sequence type for multiple profiles, click 'In a batch' from the 'Search for allelic profiles' section of the sequence definition contents page.
fr: Pour rechercher les définitions de schéma, par exemple le séquençotype pour plusieurs profils, cliquez sur 'In a batch' dans la section 'Search for allelic profiles' de la page de contenu de définition de séquence.

source: Copy and paste data from a spreadsheet. The first column is the record identifier, and the remaining columns are the alleles for each locus in the standard locus order defined for the scheme. There are links to the column order which can be used as a header line for your spreadsheet and to example data.
fr: Copier et coller les données d'un tableur. La première colonne est l'identifiant d'enregistrement, et les colonnes restantes sont les allèles pour chaque locus dans l'ordre standard défini pour le schéma. Il y a des liens vers l'ordre des colonnes qui peut être utilisé comme ligne d'en-tête pour votre tableur et vers des exemples de données.

source: Click submit after pasting in the data.
fr: Cliquez sur 'Submit' après avoir collé les données.

source: A results table will be displayed.
fr: Un tableau de résultats sera affiché.
