Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/data_query/0050_investigating_allele_differences.po
Languages: fr

source: Investigating allele differences
fr: Rechercher des différences entre allèles

source: Sequence similarity
fr: Similarité des séquences

source: To find sequences most similar to a selected allele within a sequence definition database, expand the 'Analysis' menu item and click 'Sequence similarity' on the contents page.
fr: Pour trouver les séquences les plus semblables à un allèle sélectionné dans une base de données de définition de séquence, élargissez l'élément de menu 'Analysis' et cliquez sur 'Sequence similarity' sur la page de contenu.

source: Enter the locus and allele identifer of the sequence to investigate and the number of nearest matches you'd like to see, then press submit.
fr: Entrez le locus et l'identifiant d'allèle de la séquence à étudier et le nombre de correspondances les plus proches que vous aimeriez voir, puis appuyez sur submit.

source: A list of nearest alleles will be displayed, along with the percentage identity and number of gaps between the sequences.
fr: Une liste des allèles les plus proches sera affichée, ainsi que le pourcentage d'identité et le nombre de gaps (insertions-délétions) entre les séquences.

source: Click the appropriate 'Compare' button to display a list of nucleotide differences and/or a sequence alignment.
fr: Cliquez sur le bouton 'Compare' approprié pour afficher une liste de différences de nucléotides et/ou un alignement de séquence.

source: Sequence comparison
fr: Comparaison de séquences

source: To directly compare two sequences, expand the 'Analysis' section and click 'Sequence comparison' on the contents page of a sequence definition database.
fr: Pour comparer directement deux séquences, élargir la section 'Analysis' et cliquer sur 'Sequence comparison' sur la page de contenu d'une base de données de définition de séquences.

source: Enter the locus and two allele identifiers to compare. Press submit.
fr: Entrez le locus et deux identifiants d'allèles à comparer. Cliquez sur submit.

source: A list of nucleotide differences and/or an alignment will be displayed.
fr: Une liste des différences de nucléotides et/ou un alignement seront affichés.
