Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/data_query/0070_querying_isolate_data.po
Languages: fr

source: Querying isolate data
fr: Interroger les données sur les isolats

source: The 'Search database' page of an isolate database allows you to also search by combinations of provenance criteria, scheme and locus data, and more.
fr: La page 'Search database' d'une base de données isolats vous permet également de rechercher par combinaisons de critères de provenance, de données de schéma et de locus, et plus encore.

source: To start with, only one provenance field search box is displayed but more can be added by clicking the '+' button (highlighted). These can be linked together by 'and' or 'or'.
fr: Pour commencer, une seule boîte de recherche de champ de provenance est affichée, mais autres peuvent être ajoutés en cliquant sur le bouton '+'. Ils peuvent être combinés logiquement par 'et' (AND) ou 'ou' (OR).

source: After the search has been submitted, the results will be displayed in a table.
fr: Une fois la recherche soumise, les résultats seront affichés dans un tableau.

source: Each field can be queried using :ref:`standard operators <query_operators>`.
fr: Chaque champ peut être interrogé à l'aide de :ref:`standard operators <query_operators>`.

source: More search features are available by clicking the 'Modify form options' tab on the top of the screen.
fr: D'autres fonctions de recherche sont disponibles en cliquant sur l'onglet 'Modify form options' en haut de l'écran.

source: A tab will be displayed. Different options will be available here depending on the database. Queries will be combined from the values entered in all form sections. Possible options are:
fr: Un menu sera affiché. Différentes options seront disponibles ici selon la base de données. Les requêtes seront combinées à partir des valeurs entrées dans toutes les sections du formulaire. Les options possibles sont les suivantes:

source: Provenance fields
fr: Champs de provenance

source: Search by combination of provenance field values, e.g. country, year, sender.
fr: Recherche par combinaison de valeurs de champ de provenance, par exemple pays, année, expéditeur.

source: Allele designations/scheme field values
fr: Désignations des allèles/valeurs des champs du schéma

source: Search by combination of allele designations and/or scheme fields e.g. ST, clonal complex information.
fr: Recherche par combinaison de désignations d'allèles et/ou de champs de schéma, p. ex. ST, complexe clonal.

source: Allele designation status
fr: Statut de désignation des allèles

source: Search by whether allele designation status is confirmed or provisional.
fr: Rechercher si le statut de désignation de l'allèle est confirmé ou provisoire.

source: Tagged sequence status
fr: État de la séquence

source: Search by whether tagged sequence data is available for a locus. You can also search by sequence flags.
fr: Rechercher si les données de séquence marquées sont disponibles pour un locus. Vous pouvez également rechercher par des drapeaux (flags) de séquence.

source: Attribute values list
fr: Liste de valeurs des attributs

source: Enter a list of values for any provenance field, locus, or scheme field.
fr: Saisissez une liste de valeurs pour tout champ de provenance, locus ou schéma.

source: Filters
fr: Filtres

source: Various filters may be available, including
fr: Divers filtres peuvent être disponibles, notamment:

source: Projects
fr: Projets

source: MLST profile completion status
fr: État d'achèvement du profil MLST

source: Clonal complex
fr: Complexe clonal

source: Sequence bin size
fr: Taille du bac (sequence bin, ou corbeille) de séquence

source: Inclusion/exclusion of :ref:`old versions <versioning>`
fr: Inclusion/exclusion de :ref:`old versions <versioning>`

source: If the interface is modified, a button to save options becomes available within the tab. If this is clicked, the modified form will be displayed the next time you go to the query page.
fr: Si l'interface est modifiée, un bouton pour enregistrer les options devient disponible dans l'onglet. Si cela est cliqué, le formulaire modifié sera affiché la prochaine fois que vous allez sur la page de requête.

source: Query by allele designation/scheme field
fr: Recherche par désignation allèle/champ de schéma

source: Queries can be combined with allele designation/scheme field values.
fr: Les requêtes peuvent être combinées avec des valeurs de champ de désignation d'allèle/schéma.

source: Make sure that the allele designation/scheme field values fieldset is displayed by selecting it in the 'Modify form options' tab.
fr: Assurez vous que le menu ‘allele designation’ status est affiché, en le sélectionnant dans l’onglet 'Modify form options'.

source: Designations can be queried using :ref:`standard operators <query_operators>`.
fr: Les désignations peuvent être interrogées à l'aide de :ref:`standard operators <query_operators>`.

source: Additional search terms can be combined using the '+' button.
fr: D'autres termes de recherche peuvent être combinés en utilisant le bouton '+'.

source: Add your search terms and click 'Submit'. Allele designation/scheme field queries will be combined with terms entered in other sections.
fr: Ajoutez vos termes de recherche et cliquez sur 'Soumettre'. Les requêtes de désignation d'allèle ou de schéma seront combinées avec les termes entrés dans d'autres sections.

source: Query by allele designation count
fr: Recherches selon le nombre de désignations d'allèles

source: Queries can be combined with counts of the total number of designations or for individual loci.
fr: Les requêtes peuvent être combinées avec le nombre total de désignations ou pour des loci individuels.

source: Make sure that the allele designation counts fieldset is displayed by selecting it in the 'Modify form options' tab.
fr: Assurez-vous que le menu de désignation allèle est affiché en le sélectionnant dans l'onglet 'Modify form options'.

source: For example, to find all isolates that have designations at >1000 loci, select 'total designations > 1000', then click 'Submit'.
fr: Par exemple, pour trouver tous les isolats qui ont des désignations à plus de 1000 loci, sélectionnez 'total designations > 1000', puis cliquez 'Submit'.

source: You can also search for isolates where any isolate has a particular number of designations. Use the term 'any locus' to do this.
fr: Vous pouvez également rechercher des isolats où un isolat a un nombre particulier de désignations alléliques. Utilisez le terme 'any locus' pour le faire.

source: Finally, you can search for isolates with a specific number of designations at a specific locus.
fr: Enfin, vous pouvez rechercher des isolats avec un nombre précis de désignations alléliques à un locus spécifique.

source: Additional search terms can be combined using the '+' button. Designation count queries will be combined with terms entered in other sections.
fr: D'autres termes de recherche peuvent être combinés en utilisant le bouton '+'. Les requêtes relatives au nombre de désignations seront combinées avec les termes inscrits dans d'autres sections.

source: Searches for 'all loci' with counts that include zero, e.g. 'count of any locus = 0' or with a '<' operator are not supported. This is because such searches have to identify every isolate for which one or more loci are missing. In databases with thousands of loci this can be a very expensive database query.
fr: Les recherches pour 'all loci' avec des nombres qui incluent zéro, par ex. 'count of any locus = 0' ou avec un opérateur '<' ne sont pas prises en charge. En effet, ces recherches doivent identifier chaque isolat pour lequel il manque un ou plusieurs loci. Dans les bases de données avec des milliers de loci, cela peut être une requête très coûteuse en temps de calcul.

source: Query by allele designation status
fr: Recherche par statut de désignation d'allèle

source: Allele designations can be queried based on their status, i.e. whether they are confirmed or provisional. Queries will be combined from the values entered in all form sections.
fr: Les désignations d'allèles peuvent être recherchées en fonction de leur statut, c'est-à-dire si elles sont confirmées ou provisoires. Les requêtes seront combinées à partir des valeurs saisies dans toutes les sections du formulaire.

source: Select a locus from the dropdown box and either 'provisional' or 'confirmed'. Additional query fields can be displayed by clicking the '+' button. Click 'Submit'.
fr: Sélectionnez un locus dans la boîte déroulante et soit 'provisional' ou 'confirmed'. Des champs de requête supplémentaires peuvent être affichés en cliquant sur le bouton '+'. Cliquez sur 'Submit'.

source: Provisional allele designations are marked within the results tables with a pink background. Any scheme field designations that depend on the allele in question, e.g. a MLST ST, will also be marked as provisional.
fr: Les désignations provisoires des allèles sont indiquées dans les tableaux de résultats avec un fond rose. Toute désignation de champ de schéma qui dépend de l'allèle en question, par exemple un MLST ST, sera également marquée comme provisoire.

source: Query by annotation status
fr: Recherche par statut d'annotation

source: Isolates can be queried by the annotation status of particular schemes if these have been set up. The idea is that for a well-annotated record the isolate would be expected to have allele designations for all loci in the scheme. Alternatively, different thresholds for number of loci with allele designations can be set up by the scheme administrator to indicate good or bad quality thresholds.
fr: Les isolats peuvent être recherchés par le statut d'annotation de certains schémas si ceux-ci ont été créés. L'idée est que pour une entrée bien annotée, l'isolat devrait avoir des désignations allèles pour tous les loci dans le schéma. L'administrateur du schéma peut également fixer différents seuils pour le nombre de locus avec désignation d'allèles pour indiquer des annotations de bonne ou de mauvaise qualité.

source: Make sure that the annotation status fieldset is displayed by selecting it in the 'Modify form options' tab.
fr: Assurez-vous que le menu d’état d’annotation est affiché en le sélectionnant dans l'onglet 'Modify form options'.

source: Additional search terms can be combined using the '+' button. Annotation status queries will be combined with terms entered in other sections.
fr: D'autres termes de recherche peuvent être combinés en utilisant le bouton '+'. Les requêtes de statut d'annotation seront combinées avec les termes entrés dans d'autres sections.

source: Query by sequence bin size and number of contigs
fr: Recherche par la taille de séquence et le nombre de contigs

source: Isolates can be queried based on the total length of sequences within the sequence bin, the number of contigs, the N50 and/or the L50 values.
fr: Les isolats peuvent être recherchés en fonction de la longueur totale des séquences dans leur corbeille à séquence, du nombre de contigs, des valeurs N50 et/ou L50.

source: Make sure that the sequence bin fieldset is displayed by selecting it in the ‘Modify form options’ tab.
fr: Assurez-vous que le menu de champ de sequence bin est affiché en le sélectionnant dans l'onglet ‘Modify form options’.

source: Additional search terms can be combined using the '+' button. Sequence bin queries will be combined with terms entered in other sections.
fr: D'autres termes de recherche peuvent être combinés en utilisant le bouton '+'. Les requêtes sequence bin seront combinées avec les termes entrés dans d'autres sections.

source: Query by sequence tag count
fr: Recherche par nombre de balises de séquence (sequence tags)

source: Queries can be combined with counts of the total number of tags or for individual loci.
fr: Les requêtes peuvent être combinées avec le nombre total d'étiquettes (tag) ou pour les loci individuels.

source: Make sure that the tagged sequence counts fieldset is displayed by selecting it in the 'Modify form options' tab.
fr: Assurez-vous que le menu de champs de comptage des séquences étiquetées est affiché en le sélectionnant dans l'onglet 'Modify form options'.

source: For example, to find all isolates that have sequence tags at >1000 loci, select 'total tags > 1000', then click 'Submit'.
fr: Par exemple, pour trouver tous les isolats qui ont des balises de séquence à plus de 1000 loci, sélectionnez 'total tags > 1000', puis cliquez sur Submit.

source: You can also search for isolates where any isolate has a particular number of sequence tags. Use the term 'any locus' to do this.
fr: Vous pouvez également rechercher des isolats ayant un nombre particulier d'étiquettes de séquence. Utilisez le terme 'any locus' pour le faire.

source: Finally, you can search for isolates with a specific number of tags at a specific locus.
fr: Enfin, vous pouvez rechercher des isolats avec un nombre spécifique de balises à un locus spécifique.

source: Additional search terms can be combined using the '+' button. Sequence tag count queries will be combined with terms entered in other sections.
fr: D'autres termes de recherche peuvent être combinés en utilisant le bouton '+'. Les requêtes de comptage des balises de séquence seront combinées avec les termes entrés dans d'autres sections.

source: Searches for 'all loci' with counts that include zero, e.g. 'count of any locus = 0' or with a '<' operator are not supported. This is because such searches have to identify every isolate for which one or more loci are not tagged. In databases with thousands of loci this can be a very expensive database query.
fr: Les recherches pour 'all loci' avec des nombres qui incluent zéro, par ex. 'count of any locus = 0' ou avec un opérateur '<' ne sont pas prises en charge. En effet, ces recherches doivent identifier chaque isolat pour lequel il manque un ou plusieurs loci. Dans les bases de données avec des milliers de loci, cela peut être une requête très coûteuse en temps de calcul.

source: Query by tagged sequence status
fr: Recherche par l'état de la séquence

source: Sequence tags identify the region of a contig within an isolate's sequence bin entries that correspond to a particular locus. The presence or absence of these tags can be queried as can whether or not the sequence has an a flag associated with. These flags designate specific characteristics of the sequences. Queries will be combined from the values entered in all form sections.
fr: Les balises de séquence identifient la région d'un contig à l'intérieur de la corbeille à séquences d'un isolat qui correspondent à un locus particulier. La présence ou l'absence de ces balises peut être interrogée ainsi que la présence d'un drapeau (flag) associé. Ces drapeaux désignent les caractéristiques spécifiques des séquences. Les requêtes seront combinées à partir des valeurs saisies dans toutes les sections du formulaire.

source: Make sure that the tagged sequences status fieldset is displayed by selecting it in the 'Modify form options' tab.
fr: Assurez-vous que le menu de champs d'état des séquences étiquetés est affiché en le sélectionnant dans l'onglet 'Modify form options'.

source: Select a specific locus in the dropdown box (or alternatively 'any locus') and a status. Available status values are:
fr: Sélectionnez un locus spécifique dans la boîte déroulante (ou alternativement 'any locus') et un statut. Les valeurs de statut disponibles sont:

source: untagged
fr: untagged (non étiqueté)

source: The locus has not been tagged within the sequence bin.
fr: The locus n’a pas été étiqueté (taggué) dans la corbeille à séquence

source: The locus has been tagged within the sequence bin.
fr: The locus a été étiqueté (taggué) dans la corbeille à séquence

source: The locus sequence is complete.
fr: La séquence du locus est complète.

source: The locus sequence is incomplete - normally because it continues beyond the end of a contig.
fr: La séquence du locus est incomplète – généralement parce qu’elle continue au-delà d’une extrémité de contig.

source: The sequence for the locus has a flag set.
fr: La séquence du locus a un drapeau (flag).

source: The sequence for the locus does not have a flag set.
fr: La séquence du locus n’a pas de drapeau (flag).

source: The sequence for the locus has the specific flag chosen.
fr: La séquence du locus a un drapeau (flag) spécifié tel que sélectionné.

source: Query by list of attributes
fr: Recherche par liste d'attributs

source: The query form can be modified with a list box in to which a list of values for a chosen attribute can be entered - this could be a list of ids, isolate names, alleles or scheme fields. This list will be combined with any other criteria or filter used on the page.
fr: Le formulaire de requête peut être modifié avec une boîte de liste dans laquelle une liste de valeurs pour un attribut choisi peut être saisie - il pourrait s'agir d'une liste d'ids, de noms d'isolats, d'allèles ou de champs de schéma. Cette liste sera combinée avec tout autre critère ou filtre utilisé sur la page.

source: If the list box is not shown, add it by selecting it in the 'Modify form options' tab.
fr: Si la boîte de liste n'est pas affichée, ajoutez-la en la sélectionnant dans l'onglet 'Modify form options'.

source: Select the attribute to query and enter a list of values.
fr: Sélectionnez l'attribut à requêter et entrez une liste de valeurs.

source: Query filters
fr: Filtres de requêtes

source: There are various filters that can additionally be applied to queries, or the filters can be applied solely on their own so that they filter the entire database.
fr: Il existe différents filtres qui peuvent en outre être appliqués aux requêtes. Les filtres peuvent être appliqués seuls afin qu'ils filtrent toute la base de données.

source: Make sure that the filters fieldset is displayed by selecting it in the 'Modify form options' tab.
fr: Assurez-vous que le jeu de filtres s'affiche en le sélectionnant dans l'onglet 'Modify form options'.

source: The filters displayed will depend on the database and what has been defined within it. Common filters are:
fr: Les filtres affichés dépendront de la base de données et de ce qui y a été défini. Les filtres courants sont:

source: Publication - Select one or more publication that has been linked to isolate records.
fr: Publication - Sélectionnez une ou plusieurs publications qui ont été liées à des entrées isolat.

source: Project - Select one or more project that isolates belong to.
fr: Projet - Sélectionnez un ou plusieurs projets auxquels appartiennent les isolats.

source: Profile completion - This is commonly displayed for MLST schemes. Available options are:
fr: Achèvement du profil - Ceci est couramment affiché pour les schémas MLST. Les options disponibles sont:

source: complete - All loci of the scheme have alleles designated.
fr: complete - Tous les loci du schéma sont désignés.

source: incomplete - One or more loci have not yet been designated.
fr: incomplete - Un ou plusieurs loci n’ont pas encore été désignés.

source: partial - The scheme is incomplete, but at least one locus has an allele designated.
fr: partial - Le schéma est incomplet, mais au moins un locus a un allèle désigné.

source: not started - The scheme has no loci with alleles designated.
fr: not started - Le schéma n’a aucun locus avec un allèle désigné.

source: Provenance fields - Dropdown list boxes of values for specific provenance fields may be present if set for the database. Users can choose to :ref:`add additional filters <modify_query_filters>`.
fr: Champs de provenance - Des boîtes déroulantes de valeurs pour des champs de provenance spécifiques peuvent être présentes si elles sont définies pour la base de données. Les utilisateurs peuvent choisir de :ref:`add additional filters <modify_query_filters>`.

source: Old record versions - Checkbox which, if selected, will include all record versions in a query.
fr: Old record versions - Case à cocher qui, si sélectionnée, inclura toutes les versions d'une entrée dans une requête.

source: Querying by allelic profile
fr: Recherche par profil allélique

source: If a scheme, such as MLST, has been defined for an isolate database it is possible to query the database against complete or partial allelic profiles. Even if no scheme is defined, queries can be made against all loci.
fr: Si un schéma, tel que le MLST, a été défini pour une base de données isolats, il est possible de demander à la base de données des profils alléliques complets ou partiels. Même si aucun schéma n'est défini, des requêtes peuvent être faites sur tous les loci.

source: On the index page, click 'Search by combinations of loci (profiles)' for any defined scheme. Enter either a partial (any combination of loci) or complete profile.
fr: Sur la page d'index, cliquez sur 'Search by combinations of loci (profiles)' pour tout schéma défini. Entrez un profil partiel (any combination of loci) ou complet.

source: If multiple schemes are defined, you may have to select the scheme you wish to query in the 'Schemes' dropdown box and click 'Select'.
fr: Si plusieurs schémas sont définis, il se peut que vous deviez sélectionner le schéma que vous souhaitez interroger dans la boîte déroulante 'Schemes' et cliquer sur 'Select'.

source: Enter the combination of alleles that you want to query for. Fields can be left blank.
fr: Saisissez la combinaison d'allèles que vous voulez rechercher. Les champs peuvent être laissés en blanc.

source: Alternatively, for scheme profiles, you can enter a primary key value (e.g. ST) and select 'Autofill' to automatically fill in the associated profile.
fr: Sinon, pour les profils de schéma, vous pouvez saisir une valeur clé primaire (par exemple ST) et sélectionner 'Autofill' pour remplir automatiquement le profil associé.

source: Select the number of loci that you'd like to match in the options dropdown box. Available options are:
fr: Sélectionnez le nombre de loci que vous souhaitez dans la boîte déroulante des options. Les options disponibles sont:

source: Where x,y, and z will range from n-1 to 1 where n is the number of loci in the scheme.
fr: Où x,y et z vont de n-1 à 1 où n est le nombre de loci dans le schéma.

source: Click 'Search'.
fr: Cliquez 'Search'.
