Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/data_query/0100_options.po
Languages: fr

source: User-configurable options
fr: Options configurables par l'utilisateur

source: The BIGSdb user interface is configurable in a number of ways. Choices made are remembered between sessions. If the database requires you to log on, the options are associated with your user account, whereas if it is a public database, that you haven't logged in to, the options are associated with a browser cookie so they will be remembered if you connect from the same computer (using the same browser).
fr: L'interface utilisateur BIGSdb est configurable de plusieurs façons. Les choix faits sont enregistrés entre les sessions. Si la base de données vous oblige à vous connecter, les options sont associées à votre compte utilisateur, alors que si c'est une base de données publique, à laquelle vous n'avez pas été connecté, les options sont associées à un cookie de navigateur, de sorte qu'elles seront rappelées si vous vous connectez à partir du même ordinateur (en utilisant le même navigateur).

source: Most options are set by clicking the 'Customise' link on the database contents page. Most of the available options are visible for isolate databases, whereas sequence definition databases have fewer available.
fr: La plupart des options sont définies en cliquant sur le lien 'Customise' de la page de contenu de la base de données. La plupart des options disponibles sont visibles pour les bases de données isolats, tandis que les bases de données de définition des séquences ont moins d'options.

source: General options
fr: Options générales

source: The general options tab is displayed by default. If another tab is being shown, click the 'General options' header.
fr: L'onglet Options générales (General options) s'affiche par défaut. Si un autre onglet est affiché, cliquez sur l'en-tête 'General options'.

source: The general tab allows the following options to be modified:
fr: L'onglet général permet de modifier les options suivantes :

source: Records per page
fr: Enregistrements par page

source: Page bar position
fr: Position de la barre de page

source: Nucleotides per line - Some analyses display sequence alignments. This option allows you to set the width of these alignments so suit your display.
fr: Nucleotides par ligne - Certaines analyses affichent des alignements de séquences. Cette option vous permet de régler la largeur de ces alignements de façon à correspondre à votre affichage.

source: Flanking sequence length - This sets the length of flanking sequence upstream and downstream of a particular locus that is included whenever a sequence is displayed. Flanking sequences are displayed fainter that the locus sequence.
fr: Longueur de la séquence flanquante - Ce paramètre définit la longueur de la séquence flanquante en amont et en aval d'un locus particulier qui est inclus chaque fois qu'une séquence est affichée. Les séquences flanquantes sont plus grisées que la séquence du locus.

source: Locus aliases - Loci can have multiple names (aliases). Setting this option will display all alternative names in results tables.
fr: Locus alias - Les loci peuvent avoir plusieurs noms (alias). Définir cette option affichera tous les noms alternatifs dans les tableaux de résultats.

source: Tooltips (beginner's mode) - Most query forms have help available in the form of information tooltips. These can be switched on/off here. They can also be toggled off by clicking the Toggle: 'i' button at the top-right of the display of some pages.
fr: Tooltips (mode de démarrage) - La plupart des formulaires de requête ont de l'aide disponible sous forme de tooltips d'information. Celles-ci peuvent être activées ou désactivées ici. Ils peuvent également être changés en cliquant sur le bouton Toggle: 'i' en haut à droite de l'affichage de certaines pages.

source: Click 'Set options' to remember any changes you make.
fr: Cliquez sur 'Set options' pour enregistrer les modifications que vous apportez.

source: Main results table
fr: Tableau principal des résultats

source: The 'main results table' tab contains options for the display of paged results following a query.
fr: L'onglet 'Tableau principal des résultats' contient des options pour l'affichage des résultats page à page suite à une requête.

source: Click the 'Main results table' header to display the tab.
fr: Cliquez sur l'en-tête 'Main results table' pour afficher l'onglet.

source: The 'main results table' tab will scroll up.
fr: L'onglet 'Tableau principal des résultats' défilera.

source: This tab allows the following options to be modified:
fr: Cet onglet permet de modifier les options suivantes :

source: Hyperlink allele designations - Hyperlinks point to an information page about the particular allele definition. Depending on the locus, these may exist on a different website.
fr: Hyperliens de désignations d'allèle - Hyperliens vers une page d'information sur la définition d'un allèle particulier. Selon le locus, ils peuvent pointer vers un site Web différent.

source: Differentiate provisional allele designations - Allele designations can be set as confirmed or provisional, usually depending on the method of assignment. Selecting this option will display provisional designations in a different colour to confirmed designations.
fr: Differentiate provisional allele designations - Les désignations d'allèles peuvent être définies comme confirmées ou provisoires, généralement selon la méthode d'attribution. Le choix de cette option affichera les désignations provisoires dans une couleur différente de celles confirmées.

source: Information about sequence bin records - Creates a tooltip that displays details about sequence tags corresponding to a locus.
fr: Informations sur les enregistrements de la banque de séquences (sequence bin records) - Crée une infobulle qui affiche des détails sur les balises de séquence correspondant à un locus.

source: Sequence bin records - Displays a tooltip linking to the sequence tag if available.
fr: Sequence bin records - Affiche un tooltip reliant à la balise de séquence si disponible.

source: Sequence bin size - Displays the size of the sum of all contigs associated with each isolate record.
fr: Taille de la corbeille de séquence (Sequence bin) - Affiche la taille de la somme de tous les contigs associés à chaque entrée isolat.

source: Contig count - Displays the number of contigs associated with each isolate record.
fr: Nombre de contigs - Affiche le nombre de contigs associés à chaque entrée d'isolat.

source: Assembly checks - Displays whether assembly checks have passed for a genome record.
fr: Contrôles d'assemblage - Affiche si les contrôles d'assemblage ont été effectués avec succès pour un génome.

source: Publications - Displays citations with links to PubMed for each record.
fr: Publications - Affiche les citations avec des liens vers PubMed pour chaque entrée.

source: Isolate record display
fr: Affichage des entrées isolats

source: The 'isolate record display' tab contains options for the display of a full isolate record.
fr: L'onglet 'affichage isolats' (isolate record display) contient des options pour l'affichage d'une entrée isolat complet.

source: Click the 'Isolate record display' tab to display the tab.
fr: Cliquez sur l'onglet 'Isolate record display' pour afficher l'onglet.

source: The 'Isolate record display' tab will scroll up.
fr: L'onglet 'Isolate record display' défilera.

source: Display sender, curator and last updated records - Displays a tooltip containing sender information next to each allele designation.
fr: Affiche les enregistrements de l'expéditeur, du curateur et de la dernière mise à jour - Affiche une infobulle contenant les informations de l'expéditeur à côté de chaque désignation d'allèle.

source: Sequence bin information - Displays a tooltip with information about the position of the sequence if tagged within the sequence bin.
fr: Informations sur la corbeille à séquence - Affiche une barre d'outils avec des informations sur la position de la séquence si elle est marquée dans la corbeille à séquence.

source: Allele flags - Displays information about whether alleles have flags defined in sequence definition databases.
fr: Drapeaux d'allèles (flags) - Affiche les informations indiquant si les allèles ont des drapeaux définis dans les bases de données de définition de séquences.

source: Provenance field display
fr: Affichage du champ de provenance

source: The 'provenance field display' tab contains checkboxes for fields to display in the main results table.
fr: L'onglet 'provenance field display' contient des cases à cocher pour les champs à afficher dans le tableau de résultats principal.

source: Click the 'Provenance field display' tab to display the tab.
fr: Cliquez sur l'onglet 'Provenance field display' pour afficher l'onglet.

source: The 'Provenance field display' tab will scroll up.
fr: L'onglet 'Provenance field display' va défiler.

source: Some fields will be checked by default - these are defined during :ref:`database setup <isolate_xml_field>` (maindisplay option).
fr: Certains champs seront sélectionnés par défaut - ils sont définis pendant :ref:`database setup <isolate_xml_field>` (option d'affichage principal).

source: Check any fields that you wish to be displayed and then click 'Set options'. You can return to the default selection by clicking 'Default' followed by 'Set options'.
fr: Sélectionnez tous les champs que vous souhaitez afficher, puis cliquez sur 'Set options'. Vous pouvez revenir à la sélection par défaut en cliquant sur 'Default' suivi de 'Set options'.

source: The 'query filters' tab contains checkboxes for provenance fields and scheme completion status. Checking these results in drop-down list box filters appearing in the query page :ref:`filters fieldset <query_filters>`.
fr: L'onglet 'query filters' contient des cases à cocher pour les champs de provenance et l'état d'achèvement des schémas. Cochez ces résultats dans les filtres de la liste déroulante apparaissant dans la page de requête :ref:`filters fieldset <query_filters>`.

source: Click the 'Query filters' tab to display the tab.
fr: Cliquez sur l'onglet 'Query filters' (Filtres de requêtes) pour afficher l'onglet.

source: The 'Query filters' tab will scroll up.
fr: L'onglet 'Filtres de requêtes' défilera.

source: A list of possible filters appears. Click any checkbox for a filter you would like to make available. Click 'Set options' when done. You can return to the default selection by clicking 'Default' followed by 'Set options'.
fr: Une liste de filtres possibles apparaît. Cliquez sur n'importe quelle case à cocher pour un filtre que vous souhaitez mettre à disposition. Cliquez sur 'Set options' lorsque c'est fait. Vous pouvez revenir à la sélection par défaut en cliquant sur 'Default' suivi de 'Set options'.

source: Modifying locus and scheme display options
fr: Modifier les options d'affichage locus et schéma

source: Whether or not loci, schemes or scheme fields are displayed in result tables, isolate records, or within query dropdown boxes can all be set with default options when first defined. These attributes can, however, be overridden by a user, and these selections will be remembered between sessions.
fr: Que les loci, les schémas ou les champs de schémas soient affichés ou non dans les tableaux de résultats, les entrées isolats ou dans les zones déroulantes des requêtes, peuvent tous être définis avec des options par défaut lors de la première définition. Ces attributs peuvent toutefois être écrasés par un utilisateur, et ces sélections seront mémorisées entre les sessions.

source: The procedure to modify these attributes is the same for locus, schemes or scheme fields, so the steps for loci will be demonstrated only.
fr: La procédure de modification de ces attributs est la même pour le locus, les schémas ou les champs de schéma, de sorte que seulement les étapes pour les locus seront décrites.

source: Click the appropriate link in the 'Customise' section on the isolate contents page.
fr: Cliquez sur le lien approprié dans la section 'Customise' de la page du contenu de l'isolat.

source: Either select the locus id by querying for it directly.
fr: Sélectionnez l'identifiant de locus en le cherchant directement.

source: Designations can be queried using :ref:`standard operators <query_operators>`.
fr: Les désignations peuvent être interrogées à l'aide de :ref:`standard operators <query_operators>`.

source: Alternatively, you can search by filtering loci by schemes. Click the 'Filter query by' header and select the scheme in the dropdown box.
fr: Vous pouvez également rechercher un locus en filtrant les loci par schémas. Cliquez sur l'en-tête 'Filter query by' et sélectionnez le schéma dans la zone déroulante.

source: Once loci have been selected, click Customize 'locus options'.
fr: Une fois les loci sélectionnés, cliquez sur 'Customize locus options'.

source: You can then choose to add or remove individual loci from the selection by clicking the appropriate checkboxes. At the bottom of the page are a number of attributes that you can change - clicking 'Change' will affect all selected loci.
fr: Vous pouvez ensuite choisir d'ajouter ou de supprimer des loci individuels de la sélection en cliquant sur les cases à cocher appropriées. Au bas de la page se trouvent un certain nombre d'attributs que vous pouvez modifier - cliquer sur 'Change' affectera tous les loci sélectionnés.

source: Possible options for loci are:
fr: Les options possibles pour les loci sont:

source: isolate_display - Sets how the locus is displayed within an isolate record:
fr: isolate_display - Définit comment le locus est affiché dans un enregistrement isolat :

source: allele only - display only identifier
fr: allele only - afficher uniquement l'identifiant

source: sequence - display the full sequence
fr: sequence - afficher la séquence complète

source: hide - don't show at all
fr: hide - ne montre pas du tout

source: main_display - Sets whether the locus is displayed in the main results table following a query.
fr: main_display - Définit si le locus est affiché dans le tableau de résultats principal à la suite d'une requête.

source: query_field - Sets whether the locus appears in dropdown list boxes to be used within queries.
fr: query_field - Définit si le locus apparaît dans les zones déroulantes à utiliser dans les requêtes.

source: analysis - Sets whether the locus can be used in data analysis functions.
fr: analysis - Définit si le locus peut être utilisé dans les fonctions d'analyse de données.

source: Settings for loci can be overridden by those set for schemes that they are members of. For example, if you set a locus to be displayed within a main results table, but that locus is a member of a scheme and you set that scheme not to be displayed, then the locus will not be shown. Conversely, if you set a scheme to be displayed, but set its member locus not to be shown, then that locus will not be displayed (but other loci and scheme fields may be, depending on their independent settings).
fr: Les paramètres de loci peuvent être écrasés par ceux définis pour les schémas dont ils sont membres. Par exemple, si vous définissez un locus à afficher dans une table de résultats principale, mais que ce locus est membre d'un schéma et que vous définissez ce schéma à ne pas afficher, le locus ne sera pas affiché. Inversement, si vous définissez un schéma à afficher, mais définissez son locus membre à ne pas afficher, alors ce locus ne sera pas affiché (mais d'autres locus et champs de schéma peuvent l'être, selon leurs paramètres indépendants).
