Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/data_analysis/grapetree.po
Languages: fr

source: GrapeTree is a tool for generating and visualising minimum spanning trees. It has been developed to handle large datasets (in the region of 1000s of genomes) and works with 1000s of loci as used in cgMLST. It uses an improved minimum spanning algorithm that is better able to handle missing data than alternative algorithms and is able to produce publication quality outputs. Datasets can include metadata which allows nodes in the resultant tree to be coloured interactively.
fr: GrapeTree est un outil pour générer et visualiser des minimum spanning trees (arbre couvrant minimum). Il a été développé pour traiter de grands jeux de données (milliers de génomes) et fonctionne avec des milliers de loci utilisés en cgMLST. Il utilise un algorithme amélioré qui est mieux en mesure de traiter les données manquantes que les algorithmes alternatifs et est capable de produire des images de qualité pour les publications. Les jeux de données peuvent comprendre des métadonnées qui permettent aux nœuds de l'arbre d'être colorés de façon interactive.

source: GrapeTree can be accessed by selecting the 'Analysis' section on the main contents page.
fr: Vous pouvez accéder à GrapeTree en sélectionnant la section 'Analysis' de la page de contenu principale.

source: Jump to the 'Third party' category, follow the link to GrapeTree, then click 'Launch GrapeTree'.
fr: Aller à la catégorie 'Third party', suivre le lien vers GrapeTree, puis cliquez sur 'Launch GrapeTree'.

source: GrapeTree can be accessed from the contents page by clicking the 'GrapeTree' link.
fr: Vous pouvez accéder à GrapeTree depuis la page de contenu en cliquant sur le lien 'GrapeTree'.

source: Alternatively, it can be accessed following a query by clicking the 'GrapeTree' button at the bottom of the results table. Isolates returned from the query will be automatically selected within the GrapeTree interface.
fr: On peut également y accéder à la suite d'une requête en cliquant sur le bouton 'GrapeTree' en bas du tableau de résultats. Les isolats retournés à partir de la requête seront automatiquement sélectionnés dans l'interface GrapeTree.

source: Select the isolates to include. The tree can be generated from allelic profiles of any selection of loci, or more conveniently, you can select a scheme in the scheme selector, or choose from recommended schemes if these have been set, to include all loci belonging to that scheme.
fr: Sélectionnez les isolats à inclure. L'arbre peut être généré à partir de profils alléliques de n'importe quelle sélection de loci, ou plus commodément, vous pouvez sélectionner un schéma dans le sélecteur de schéma, ou choisir parmi les schémas recommandés si ceux-ci ont été définis, pour inclure tous les loci appartenant à ce schéma.

source: Additional fields can be selected to be included as metadata for use in colouring nodes - select any fields you wish to include. Finally you can choose the analysis method from the following:
fr: D'autres champs peuvent être sélectionnés pour être inclus comme métadonnées à utiliser pour colorer les nœuds - sélectionnez les champs que vous souhaitez inclure. Enfin, vous pouvez choisir la méthode d'analyse parmi les suivantes:

source: MSTreeV2 - Improved minimum-spanning tree that better handles missing data (default)
fr: MSTreeV2 - Arbre couvrant minimum amélioré pour mieux gérer les données manquantes (par défaut)

source: MSTree - Classical minimum-spanning tree similar to PhyloViz
fr: MSTree - Arbre couvrant minimum classique semblable à PhyloViz

source: RapidNJ - RapidNJ Neighbour-joining tree for very large datasets
fr: RapidNJ - RapidNJ Neighbour-joining tree pour très gros ensembles de données

source: Click 'Submit' to start the analysis.
fr: Cliquez sur 'Submit' pour lancer l'analyse.

source: The job will be sent to the job queue. When it has finished, click the button marked 'Launch GrapeTree'.
fr: Le job sera envoyé à la file d'attente. Une fois terminé, cliquez sur le bouton 'Launch GrapeTree'.

source: The generated tree will be rendered in the GrapeTree application page.
fr: L'arbre généré sera rendu dans la page d'application GrapeTree.

source: The image can be manipulated in various ways. These include modifying the tree layout, customising node labels and size, modifying branch lengths and collapsing branches. The image can be saved in SVG format which can be further edited in image publishing software such as Inkscape.
fr: L'image peut être modifiée de différentes façons. Il s'agit notamment de modifier la disposition de l'arbre, de personnaliser les étiquettes et la taille des nœuds, de modifier les longueurs des branches et de fusionner les branches. L'image peut être enregistrée au format SVG qui peut être éditée dans un logiciel d'édition d'images comme Inkscape.

source: As an example, the default cgMLST tree (above) has been modified (below) as follows:
fr: Par exemple, l'arborescence cgMLST par défaut (ci-dessus) a été modifiée (ci-dessous) comme suit :

source: Nodes coloured by clonal complex
fr: Nœuds colorés par complexe clonal

source: Labels removed
fr: Étiquettes (labels) retirées

source: Branches collapsed where <=100 loci different
fr: Branches fusionnées si <=100 loci différents

source: Node size set to 200%
fr: Taille du nœud fixée à 200%

source: Kurtosis (node size relative to number of isolates) set to 75%
fr: Kurtosis (taille du noeud par rapport au nombre d'isolats) fixée à 75%

source: Dynamic rendering allowed to run to fan out nodes
fr: Le rendu dynamique a été exécuté pour déployer les nœuds

source: Full details can be found in the `GrapeTree manual <https://bitbucket.org/enterobase/enterobase-web/wiki/GrapeTree>`_.
fr: On trouvera de plus amples renseignements dans le `GrapeTree manual <https://bitbucket.org/enterobase/enterobase-web/wiki/GrapeTree>`_.

source: GrapeTree has been described in the following publication:
fr: GrapeTree a été décrit dans la publication suivante:
