Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/data_analysis/kaptive.po
Languages: fr

source: Kaptive is a tool for surface polysaccharide typing from bacterial genome sequences, specifically for *Klebsiella* and *Acinetobacter baumannii* although it can be extended for other organisms. This plugin is a wrapper that runs Kaptive for selected isolates, outputs the results and also stores them within the database so that they can be shown within the isolate information page.
fr: Kaptive est un outil pour le typage des polysaccharides de surface à partir de séquences génomiques, spécifiquement pour *Klebsiella* et *Acinetobacter baumannii* bien qu'il puisse être étendu pour d'autres organismes. Ce plugin est un wrapper qui exécute Kaptive pour des isolats sélectionnés, sort les résultats et les stocke dans la base de données afin qu'ils puissent être affichés dans la page d'information des isolats.

source: Kaptive will usually only be available on databases hosting suitable data i.e. *Klebsiella* or *Acinetobacter baumannii* isolates.
fr: En général, Kaptive n'est disponible que sur les bases de données contenant des données appropriées, c'est-à-dire des isolats de *Klebsiella* ou d'*Acinetobacter baumannii*.

source: Documentation for Kaptive can be found at https://kaptive.readthedocs.io/en/latest/.
fr: La documentation pour Kaptive peut être consultée à l'adresse https://kaptive.readthedocs.io/fr/latest/.

source: If you use the results of Kaptive, you should cite the following:
fr: Si vous utilisez les résultats de Kaptive, vous devez citer :

source: If you use the *Klebsiella* K or O locus databases, you should also cite:
fr: Si vous utilisez les bases de données des loci K ou O de *Klebsiella*, vous devez également citer:

source: If you use the *A. baumannii* K or OC locus databases, please also cite:
fr: Si vous utilisez les bases de données des loci K ou OC de *A. baumannii* , veuillez également citer:

source: The function can be accessed by selecting the 'Analysis' section on the main contents page.
fr: On peut accéder à Kaptive en sélectionnant la section 'Analysis' de la page de contenu principale.

source: Alternatively, it can be accessed following a query by clicking the ‘Kleborate’ button in the 'Third party' list at the bottom of the results table. Please note that the list of functions here may vary depending on the setup of the database.
fr: Il est possible d'y accdér également, à la suite d'une requête, en cliquant sur le bouton ‘Kleborate' dans la liste 'Third party' en bas du tableau de résultats. Veuillez noter que la liste des fonctions disponibles ici peut varier selon la configuration de la base de données.

source: Select the isolate records to analyse - these will be pre-selected if you accessed the plugin following a query.
fr: Sélectionnez les entrées isolats à analyser - celles-ci seront présélectionnées si vous avez accédé au plugin suite à une requête.

source: Click submit.
fr: Cliquez sur Submit.

source: The analysis will be submitted to the job queue.
fr: L'analyse sera soumise à la file d'attente.

source: When the job has completed you will see a files available for download in tab-delimited text and Excel formats, as well as SVG file(s) containing a visualisation of each locus.
fr: Une fois le job terminé, vous verrez des fichiers disponibles au téléchargement dans des formats de texte et Excel, ainsi que des fichiers SVG contenant une visualisation de chaque locus.
