Repository: ArmOvse/BIGSdb_documentation
Catalog: locales/*/LC_MESSAGES/data_analysis/kleborate.po
Languages: fr

source: Kleborate is a tool that can be used to screen assemblies of *Klebsiella* *pneumoniae* and the *Klebsiella pneumoniae* species complex (KpSC) for:
fr: Kleborate est un outil utilisé pour analyser les assemblages génomiques du complexe d'espèces de Klebsiella pneumoniae (KpSC) pour :

source: MLST sequence type
fr: Séquençotype MLST

source: species (e.g. *K. pneumoniae*, *K. quasipneumoniae*, *K. variicola*, etc.)
fr: espèces (p. ex. *K. pneumoniae*, *K. quasipneumoniae*, *K. varicola*, etc.)

source: ICE *Kp* associated virulence loci: yersiniabactin (*ybt*), colibactin (*clb*), salmochelin (*iro*), hypermucoidy (*rmpA*)
fr: Loci de virulence associés à ICEKp : yersiniabactine (*ybt*), colibacine (*clb*), salmochéline (*iro*), hypermucosité (*rmpA*)

source: virulence plasmid associated loci: salmochelin (*iro*), aerobactin (*iuc*), hypermucoidy (*rmpA*, *rmpA2*)
fr: Loci plasmidiques associés à la virulence : salmochéline (*iro*), aérobactine (*iuc*), hypermucoidy (*rmpA*, *rmpA2*)

source: antimicrobial resistance determinants: acquired genes, SNPs, gene truncations and intrinsic β-lactamases
fr: déterminants de la résistance antimicrobienne: gènes acquis, SNPs, troncations de gènes et β-lactamases intrinsèques

source: K (capsule) and O antigen (LPS) serotype prediction, via *wzi* alleles and Kaptive.
fr: Prédiction du sérotype K (capsule) et de l'antigène O (LPS), via les allèles *wzi* et Kaptive.

source: Kleborate will usually only be available on databases hosting suitable data i.e. *Klebsiella* isolates.
fr: Kleborate ne sera généralement disponible que dans les bases de données contenant des données appropriées, c'est-à-dire *Klebsiella* ou *Escherichia coli*.

source: The function can be accessed by selecting the 'Analysis' section on the main contents page.
fr: La fonction est accessible en sélectionnant la section 'Analysis' sur la page principale du contenu

source: Jump to the ‘Third party’ category, follow the link to Kleborate, then click ‘Launch Kleborate’.
fr: Allez à la catégorie ‘Third party’, suivez le lien vers Kleborate, puis cliquez sur ‘Launch Kleborate’.

source: Alternatively, it can be accessed following a query by clicking the ‘Kleborate’ button in the 'Third party' list at the bottom of the results table. Please note that the list of functions here may vary depending on the setup of the database.
fr: On peut également y accéder à la suite d'une requête en cliquant sur le bouton ‘Kleborate' dans la liste 'Third party' en bas du tableau de résultats. Veuillez noter que la liste des fonctions ici peut varier selon la configuration de la base de données.

source: Select the isolate records to analyse - these will be pre-selected if you accessed the plugin following a query. You can then choose the analysis to run:
fr: Sélectionnez les entrées isolats à analyser - celles-ci seront présélectionnées si vous avez accédé au plugin suite à une requête. Vous pouvez alors choisir l'analyse à exécuter:

source: Basic screening for species, MLST and virulence loci
fr: Criblage basique pour l'espèce, MLST et les loci de virulence

source: As above and turn on screening for resistance genes (--resistance)
fr: Comme ci-dessus, et aussi activer la recherche des gènes de résistance (--résistance)

source: As above and turn on screening for K & O antigen loci (--all)
fr: Comme ci-dessus, et aussi activer la recherche des loci d'antigènes K & O (--tous)

source: Click submit.
fr: Cliquez sur submit.

source: The analysis will be submitted to the job queue.
fr: L'analyse sera soumise à la file d'attente.

source: When the job has completed you will see a table of results that is also available for download in tab-delimited text and Excel formats.
fr: Une fois le travail terminé, vous verrez un tableau de résultats qui est également disponible pour le téléchargement dans les format texte et Excel.
